
var app = angular.module("MyApp",['ngRoute','ngAnimate']);

app.config(['$routeProvider',
  function($routeProvider) {
    $routeProvider.
      when('/estates', {
        templateUrl: 'partials/estate-codes.html',
        controller: 'EstateCodesCtrl'
      }).
      when('/countries', {
        templateUrl: 'partials/country-codes.html',
        controller: 'CountryCodesCtrl'
      }).
      when('/necessary', {
            templateUrl: 'partials/necessary-codes.html',
            controller: 'NecessaryCodesCtrl'
      }).
        when('/plates', {
            templateUrl: 'partials/plates.html',
            controller: 'PlatesCtrl'
        }).
        when('/tehran', {
            templateUrl: 'partials/tehran.html',
            controller: 'TehranCodesCtrl'
        }).
        when('/about', {
            templateUrl: 'partials/about.html',
            controller: 'AboutCtrl'
        }).
      otherwise({
        redirectTo: '/estates'
      });
  }]);

app.controller("MainCtrl",['$scope', function($scope) {
    $scope.$on('$routeChangeStart', function(event,next, current) {
       path = next.originalPath;
       href = "#"+path;
       $('.active').removeClass('active');
       $("ul.navbar-nav li a[href$='"+href+"']").parent('li').addClass('active');
       setTimeout(function(){ $('#query').focus();}, 1000);
    });

}]);

app.controller("EstateCodesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.codes = CodeSrv.getEstateCodes();
    $scope.placeholder = "پیش شماره یا نام استان یا سرویس دهنده";
}]);

app.controller("CountryCodesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.codes = CodeSrv.getCountryCodes();
    $scope.placeholder = "پیش شماره یا نام کشور";
}]);

app.controller("NecessaryCodesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.necessaryCodes = CodeSrv.getNecessary();
    $scope.placeholder = "شماره تلفن های اضطراری";
}]);

app.controller("PlatesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.codes = CodeSrv.getPlates();
    $scope.placeholder = "شماره پلاک یا نام استان";
}]);

app.controller("TehranCodesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.tehranCode = CodeSrv.getTehranCodes()
    $scope.placeholder = "پیش‌شماره یا نام مرکز یا نام منطقه";
}]);
app.controller("AboutCtrl",['$scope',function($scope){
   $scope.placeholder = "Pishshomare | پیش شماره"
}])

app.factory("CodeSrv",function(){

/*

app.config(['$routeProvider',
  function($routeProvider) {
    $routeProvider.
      when('/estates', {
        templateUrl: 'partials/estate-codes.html',
        controller: 'EstateCodesCtrl'
      }).
      when('/countries', {
        templateUrl: 'partials/country-codes.html',
        controller: 'CountryCodesCtrl'
      }).
      when('/necessary', {
            templateUrl: 'partials/necessary-codes.html',
            controller: 'NecessaryCodesCtrl'
      }).
      when('/plates', {
        templateUrl: 'partials/plates.html',
        controller: 'PlatesCtrl'
      }).
      otherwise({
        redirectTo: '/estates'
      });
  }]);

app.controller("MainCtrl",['$scope', function($scope) {
  $scope.w ="hh";
    $scope.$on('$routeChangeStart', function(event,next, current) {
       path = next.originalPath;
       href = "#"+path;
       $('.active').removeClass('active');
       $("ul.navbar-nav li a[href$='"+href+"']").parent('li').addClass('active');
       setTimeout(function(){ $('#query').focus();}, 1000);


    });
    $scope.filterFunction = function(element) {
            return element.name.match(/^Ma/) ? true : false;
        }
}]);

app.controller("EstateCodesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.estateCodes = CodeSrv.getEstateCodes();
}]);
app.controller("NecessaryCodesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.necessaryCodes = CodeSrv.getNecessary();
}]);

app.controller("CountryCodesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.countryCodes = CodeSrv.getCountryCodes();
}]);

app.controller("PlatesCtrl",['$scope','CodeSrv', function($scope,CodeSrv) {
    $scope.plates = CodeSrv.getPlates();

}]);

app.factory("CodeSrv",function(){
    var necessary = [
        {name: "خرابی تلفن ۱۷", eng:"17"},
        {name: "فوریتهای پلیسی ۱۱۰", eng:"110"},
        {name: "۱۱۳ ستاد خبری وزارت اطلاعات", eng:"113"},
        {name: "اورژانس تهران ۱۱۵", eng:"115"},
        {name: "حفاظت نیروی انتظامی ۱۱۶", eng:"116"},
        {name: "اطلاعات تلفنی ۱۱۸", eng:"118"},
        {name: "ساعت گویا ۱۱۹", eng:"119"},
        {name: "شرکت آب و فاضلاب ۱۲۲", eng:"122"},
        {name: "اورژانس اجتماعی ۱۲۳", eng:"123"},
        {name: "سازمان بازرسی ونظارت برتوزیع کالا ۱۲۴", eng:"124"},
        {name: "آتش‌نشانی ۱۲۵", eng:"125"},
        {name: "رزرو تلفن بین شهری ۱۲۶", eng:"126"},
        {name: "خرابی تلکس ۱۲۷", eng:"127"},
        {name: "قوه قضائیه ۱۲۹", eng:"129"},
        {name: "تاکسی تلفنی ۱۳۳", eng:"133"},
        {name: "سازمان هواشناسی ۱۳۴", eng:"134"},
        {name: "۱۳۶ سازمان بازرسی کل کشور", eng:"136"},
        {name: "شهرداری تهران ۱۳۷", eng:"137"},
        {name: "وزارت کشور ۱۳۸", eng:"138"},
        {name: "شرکت قطارهای مسافری رجا ۱۳۹", eng:"139"},
        {name: "شرکت پست ( اعلام کد پستی ) ۱۴۰", eng:"140"},
        {name: "وزارت راه و ترابری ۱۴۱", eng:"141"},
        {name: "سازمان تامین اجتماعی ۱۴۲", eng:"142"},
        {name: "اداره کل بیمه خدمات درمانی ۱۴۳", eng:"143"},
        {name: "ندای قرآن ۱۴۴", eng:"144"},
        {name: "۱۴۷ ندای امداد جمعیت هلال احمر", eng:"147"},
        {name: "ندای مشاور بهزیستی ۱۴۸", eng:"148"},
        {name: "ندای بهشت ۱۴۹", eng:"149"},
        {name: "سازمان صدا و سیما (ارتباطات مردمی) ۱۶۲", eng:"162"},
        {name: "سازمان فنی و حرفه ای ۱۶۷", eng:"167"},
        {name: "۱۹۰ واحد ارتباطات مردمی شرکت مخابرات استان تهران", eng:"190"},
        {name: "اعلام داروخانه های شبانه روزی ۱۹۱", eng:"191"},
        {name: "اعلام تقویم و اوقات شرعی ۱۹۲", eng:"192"},
        {name: "پست تلفنی ۱۹۳", eng:"193"},
        {name: "شرکت گاز (حوادث گاز) ۱۹۴", eng:"194"},
        {name: "رزرو تلفن بین الملل ۱۹۵", eng:"195"},
        {name: "۱۹۶ دریافت پیشنهادات و انتقادات کدهای ۱۱۸-۱۲۶ - ۱۹۵ و دفاتر بهره برداری", eng:"196"},
        {name: " ۱۹۷ نظارت همگانی فرماندهی ناجا", eng:"197"},
        {name: "۱۹۹ هواپیمایی جمهوری اسلامی ایران", eng:"199"},
        {name: "۰۹۹۹۰ پاسخگویی تلفن همراه", eng:"09990"},
        {name: "۶۱۳۳ دفتر ریاست جمهوری  (ارتباطات مردمی)", eng:"6133"},
        {name: "۲۲۱۶۰ سازمان صدا وسیمای جمهوری اسلامی ایران", eng:"22160"},
        {name: "۲۳۸۱۹ شرکت برق منطقه تهران", eng:"23819"},
        {name: "۳۸۵۸۱ دادستانی کل کشور", eng:"38581"},
        {name: "مجلس شورای اسلامی ۳۹۹۳۱", eng:"39931"},
        {name: "۳۹۹۷۱ شرکت توزیع نیروی برق", eng:"39971"},
        {name: "۵۱۰۰۱ فرودگاه بین المللی امام خمینی (ره)", eng:"51001"},
        {name: "۵۵۱۲۱ شرکت راه آهن", eng:"55121"},
        {name: "دفتر مقام رهبری ۶۴۴۱۱", eng:"64411"},
        {name: "دفتر ریاست جمهوری ۶۴۴۵۱", eng:"64451"},
        {name: "۶۴۵۱۱-۲ سازمان حج و زیارت", eng:"64511-2"},
        {name: "سازمان آب ۶۶۱۷۱", eng:"66171"},
        {name: "۹۱۱۳۳۳۳ هواپیمایی جمهوری اسلامی ایران", eng:"9113333"},
        {name: "۳۳۱۱۱۰۴۴ شکایات ارتباطات بین الملل", eng:"33111044"},
        {name: "۶۰۹۹۲۸۲۸ اعلام ارز گـویا", eng:"60992828"},
        {name: "۶۶۹۳۹۵۹۵ اداره گذرنامه", eng:"66939595"},
        {name: "۸۸۰۵۱۰۱۱ سازمان آتش نشانی", eng:"88051011"},
        {name: "۸۸۷۷۶۰۲۸ مرکز اطلاع رسانی داروها و سموم دانشکده داروسازی", eng:"88776028"},
        {name: "۸۸۷۴۰۱۶۳-۵ تلفن گویای مترو", eng:"88740163-5"},
        {name: "۸۸۹۰۰۸۸۹ وزارت بازرگانی", eng:"88900889"}

    ];
*/


   var necessary = [
        {name: "خرابی تلفن ۱۷", eng:"17"},
        {name: "فوریتهای پلیسی ۱۱۰", eng:"110"},
        {name: "۱۱۳ ستاد خبری وزارت اطلاعات", eng:"113"},
        {name: "اورژانس تهران ۱۱۵", eng:"115"},
        {name: "حفاظت نیروی انتظامی ۱۱۶", eng:"116"},
        {name: "اطلاعات تلفنی ۱۱۸", eng:"118"},
        {name: "ساعت گویا ۱۱۹", eng:"119"},
        {name: "شرکت آب و فاضلاب ۱۲۲", eng:"122"},
        {name: "اورژانس اجتماعی ۱۲۳", eng:"123"},
        {name: "سازمان بازرسی ونظارت برتوزیع کالا ۱۲۳", eng:"124"},
        {name: "آتش‌نشانی ۱۲۵", eng:"125"},
        {name: "رزرو تلفن بین شهری ۱۲۶", eng:"126"},
        {name: "خرابی تلکس ۱۲۷", eng:"127"},
        {name: "قوه قضائیه ۱۲۹", eng:"129"},
        {name: "تاکسی تلفنی ۱۳۳", eng:"133"},
        {name: "سازمان هواشناسی ۱۳۴", eng:"134"},
        {name: "۱۳۶ سازمان بازرسی کل کشور", eng:"136"},
        {name: "شهرداری تهران ۱۳۷", eng:"137"},
        {name: "وزارت کشور ۱۳۸", eng:"138"},
        {name: "شرکت قطارهای مسافری رجا ۱۳۹", eng:"139"},
        {name: "شرکت پست ( اعلام کد پستی ) ۱۴۰", eng:"140"},
        {name: "وزارت راه و ترابری ۱۴۱", eng:"141"},
        {name: "سازمان تامین اجتماعی ۱۴۲", eng:"142"},
        {name: "اداره کل بیمه خدمات درمانی ۱۴۳", eng:"143"},
        {name: "ندای قرآن ۱۴۴", eng:"144"},
        {name: "۱۴۷ ندای امداد جمعیت هلال احمر", eng:"147"},
        {name: "ندای مشاور بهزیستی ۱۴۸", eng:"148"},
        {name: "ندای بهشت ۱۴۹", eng:"149"},
        {name: "سازمان صدا و سیما (ارتباطات مردمی) ۱۶۲", eng:"162"},
        {name: "سازمان فنی و حرفه ای ۱۶۷", eng:"167"},
        {name: "۱۹۰ واحد ارتباطات مردمی شرکت مخابرات استان تهران", eng:"190"},
        {name: "اعلام داروخانه های شبانه روزی ۱۹۱", eng:"191"},
        {name: "اعلام تقویم و اوقات شرعی ۱۹۲", eng:"192"},
        {name: "پست تلفنی ۱۹۳", eng:"193"},
        {name: "شرکت گاز (حوادث گاز) ۱۹۴", eng:"194"},
        {name: "رزرو تلفن بین الملل ۱۹۵", eng:"195"},
        {name: "۱۹۶ دریافت پیشنهادات و انتقادات کدهای ۱۱۸-۱۲۶ - ۱۹۵ و دفاتر بهره برداری", eng:"196"},
        {name: " ۱۹۷ نظارت همگانی فرماندهی ناجا", eng:"197"},
        {name: "۱۹۹ هواپیمایی جمهوری اسلامی ایران", eng:"199"},
        {name: "۰۹۹۹۰ پاسخگویی تلفن همراه", eng:"09990"},
        {name: "۶۱۳۳ دفتر ریاست جمهوری  (ارتباطات مردمی)", eng:"6133"},
        {name: "۲۲۱۶۰ سازمان صدا وسیمای جمهوری اسلامی ایران", eng:"22160"},
        {name: "۲۳۸۱۹ شرکت برق منطقه تهران", eng:"23819"},
        {name: "۳۸۵۸۱ دادستانی کل کشور", eng:"38581"},
        {name: "مجلس شورای اسلامی ۳۹۹۳۱", eng:"39931"},
        {name: "۳۹۹۷۱ شرکت توزیع نیروی برق", eng:"39971"},
        {name: "۵۱۰۰۱ فرودگاه بین المللی امام خمینی (ره)", eng:"51001"},
        {name: "۵۵۱۲۱ شرکت راه آهن", eng:"55121"},
        {name: "دفتر مقام رهبری ۶۴۴۱۱", eng:"64411"},
        {name: "دفتر ریاست جمهوری ۶۴۴۵۱", eng:"64451"},
        {name: "۶۴۵۱۱-۲ سازمان حج و زیارت", eng:"64511-2"},
        {name: "سازمان آب ۶۶۱۷۱", eng:"66171"},
        {name: "۹۱۱۳۳۳۳ هواپیمایی جمهوری اسلامی ایران", eng:"9113333"},
        {name: "۳۳۱۱۱۰۴۴ شکایات ارتباطات بین الملل", eng:"33111044"},
        {name: "۶۰۹۹۲۸۲۸ اعلام ارز گـویا", eng:""},
        {name: "۶۶۹۳۹۵۹۵ اداره گذرنامه", eng:"66939595"},
        {name: "۸۸۰۵۱۰۱۱ سازمان آتش نشانی", eng:"88051011"},
        {name: "۸۸۷۷۶۰۲۸ مرکز اطلاع رسانی داروها و سموم دانشکده داروسازی", eng:"88776028"},
        {name: "۸۸۷۴۰۱۶۳-۵ تلفن گویای مترو", eng:"88740163-5"},
        {name: "۸۸۹۰۰۸۸۹ وزارت بازرگانی", eng:"88900889"}

    ];
    var estateCodes = [
        { name:  "آذربایجان شرقی ۰۴۱", eng: "Azerbaijan East 041"},
        { name:  "آذربایجان غربی ۰۴۴", eng: "Azerbaijan West 044"},
        { name:  "اردبیل ۰۴۵", eng: "Ardabil 045"},
        { name:  "اصفهان ۰۳۱", eng: "Isfahan 031"},
        { name:  "البرز ۰۲۶", eng: "Alborz 026"},
        { name:  "ایلام ۰۸۴", eng: "Ilam 084"},
        { name:  "بوشهر ۰۷۷", eng: "Bushehr 077"},
        { name:  "تهران ۰۲۱", eng: "Tehran 021"},
        { name:  "چهارمحال و بختیاری ۰۳۸", eng: "Chahar-Mahaal-Bakhtiari 038"},
        { name:  "خراسان جنوبی ۰۵۶", eng: "Khorasan South 056"},

        { name:  "خراسان رضوی ۰۵۱", eng: "Khorasan Razavi 051",
          cities : [{name:"05 خلق آباد"},{name:"آب جهان رهورد"},{name:"آبروان"},{name:"آبرودتربت حیدریه"},{name:"آبرودسبزوار"},{name:"آبقه"},{name:"آبگرگ"},{name:"آبگرم"},{name:"آبینه"},{name:"آریان"},{name:"آزادمنجیر"},{name:"آزاده ده"},{name:"آزادوار"},{name:"آق کاریز"},{name:"آلماجوق"},{name:"آلی"},{name:"آهنگ"},{name:"آهنگران"},{name:"ابارش"},{name:"ابدال آباد"},{name:"ابراهیم آباد"},{name:"ابراهیم آباد مشهد"},{name:"ابوچناری"},{name:"احمدآباد بالاجوین"},{name:"احمدآباد تبادگان"},{name:"احمدآباد تربت جام"},{name:"احمدآباد خزائی"},{name:"احمدآباد خواف"},{name:"احمدآباد رشتخوار"},{name:"احمدآباد سرجام"},{name:"احمدآباد قوچان"},{name:"احمدآباد محولات"},{name:"احمدآباد نیشابور"},{name:"اخلمد"},{name:"اردمه"},{name:"اردوغش"},{name:"ارزنه"},{name:"ارسک"},{name:"ارغا"},{name:"ارگ نوجوی"},{name:"اره آبمال"},{name:"ازغد"},{name:"ازغند"},{name:"استاد"},{name:"استای"},{name:"استیر"},{name:"اسجیل"},{name:"اسحاق آبادتربت حیدریه"},{name:"اسحاق آبادنیشابور"},{name:"اسدآباد خواف"},{name:"اسدآباد دربندی"},{name:"اسدآبادرخ"},{name:"اسفیز"},{name:"اسفیوخ"},{name:"اسلام آباد تربت حیدریه"},{name:"اسلام آباد نیشابور"},{name:"اسلامیه"},{name:"اسماعیل آباد گرجی"},{name:"افچنگ"},{name:"اقرعلیا"},{name:"اکبرآباد رشتخوار"},{name:"اکبرآبادریوش"},{name:"المجوق"},{name:"النگ امان آباد"},{name:"الهیان"},{name:"امام وردیخان"},{name:"امام تقی"},{name:"امامقلی"},{name:"امان آباد"},{name:"امرغان سفلی"},{name:"امغان"},{name:"انابد"},{name:"انارستانک خانیک برون"},{name:"انداد"},{name:"انداده"},{name:"اوارشک"},{name:"اوندر"},{name:"ایده لیک"},{name:"ایزی"},{name:"ایورتربت حیدریه"},{name:"باب الحکم"},{name:"باجگیران"},{name:"باخرز"},{name:"بار"},{name:"باسفر"},{name:"باشتین"},{name:"باغ عباسی"},{name:"باغ کشمیر"},{name:"باغجر"},{name:"باغستان"},{name:"باغشن گچ"},{name:"باغشن نیشابور"},{name:"بایگ"},{name:"بتو"},{name:"بجدن تکاب"},{name:"بجدن خواشد"},{name:"بجستان"},{name:"بجنو"},{name:"بداغ آباد"},{name:"برآباد تربت حیدریه"},{name:"برآباد سبزوار"},{name:"برازق"},{name:"براکوه"},{name:"برج قلعه"},{name:"برجک"},{name:"بردسکن"},{name:"برزنون"},{name:"برزو"},{name:"برس"},{name:"برغمد"},{name:"برقبان"},{name:"برود علی آباد"},{name:"برون"},{name:"بزجانی"},{name:"بزد"},{name:"بزق"},{name:"بزنگان"},{name:"بزوشک"},{name:"بشرآباد"},{name:"بشرویه"},{name:"بشنج"},{name:"بقمج"},{name:"بقیع"},{name:"بلقان آباد"},{name:"بندازبک"},{name:"بندقرا"},{name:"بنی تاک"},{name:"بنیاباد"},{name:"بهدادین"},{name:"بهمن جان سفلی"},{name:"بهمن جان علیا"},{name:"بوری آباد"},{name:"بوژآباد"},{name:"بوژان"},{name:"بوژمهران"},{name:"بیاس آباد"},{name:"بید"},{name:"بیدخت"},{name:"بیدسکان"},{name:"بیدوی"},{name:"بیزه"},{name:"بیگ نظر"},{name:"بیگلر"},{name:"بیمرغ"},{name:"بینالود"},{name:"پالکانلو"},{name:"پرکند"},{name:"پرمه فارمد"},{name:"پس کمر"},{name:"پشته"},{name:"پطرو"},{name:"پل بند"},{name:"پیوه ژن"},{name:"تاج الدین"},{name:"تام میرزاحسن"},{name:"تایباد"},{name:"تبادگان"},{name:"تپه سلام"},{name:"تپه میراحمد"},{name:"تربت جام"},{name:"تربت حیدریه"},{name:"تربقان"},{name:"تقی آباد"},{name:"تکمار"},{name:"تگن"},{name:"تلخ بخش"},{name:"تندک"},{name:"تنگل شورعلیا"},{name:"تنورچه"},{name:"تورانه"},{name:"تولی بختیار"},{name:"توندر"},{name:"تیرگان"},{name:"تیزآب"},{name:"تیمنک علیا سفلی"},{name:"جابوز"},{name:"جاغرق"},{name:"جردوی"},{name:"جزین"},{name:"جشن آباد"},{name:"جعفرآباد تربت جام"},{name:"جعفرآباد زاوه"},{name:"جعفرآباد کاشمر"},{name:"جعفریه"},{name:"جغتای"},{name:"جغری"},{name:"جلال آباد"},{name:"جلمبادان"},{name:"جلین"},{name:"جنت آباد تربت جام"},{name:"جنت آباد جنگل"},{name:"جنت آباد محولات"},{name:"جنداب"},{name:"جنگل"},{name:"جهان آباد"},{name:"جوادیه"},{name:"جوزان شیرزن"},{name:"جوزقان"},{name:"جیزآباد"},{name:"جیلو"},{name:"جیم آباد"},{name:"چاپشلو"},{name:"چاله زرد"},{name:"چاه زول"},{name:"چاه سالار"},{name:"چاه نسر"},{name:"چاهشک"},{name:"چاهشورک"},{name:"چاهک"},{name:"چخماق"},{name:"چرمشهر"},{name:"چرو"},{name:"چزگ"},{name:"چشام"},{name:"چشمه گل"},{name:"چقر"},{name:"چکنه سفلی"},{name:"چکودر"},{name:"چگنه سفلی"},{name:"چمگرد"},{name:"چمن آباد"},{name:"چناران قوچان"},{name:"چناران نیشابور"},{name:"چنارتربت حیدریه"},{name:"چنارقوچان"},{name:"چنارمشهد"},{name:"چنبرجوق"},{name:"چهاربرج"},{name:"چهاربرجی"},{name:"چهارده"},{name:"چهچهه کلات"},{name:"چهچهه پائین ده"},{name:"چیتگر"},{name:"حاتم قلعه"},{name:"حاجی آباد تربت حیدریه"},{name:"حاجی آباد فردوس"},{name:"حاجی آباد نیشابور"},{name:"حاجی بیگی"},{name:"حارث آباد"},{name:"حسن آباد بردسکن"},{name:"حسن آباد پائین"},{name:"حسن آباد تربت جام"},{name:"حسن آباد خواف"},{name:"حسن آباد درگز"},{name:"حسن آباد صوفی"},{name:"حسن آباد قوچان"},{name:"حسن آباد محولات"},{name:"حسن آباد نیشابور"},{name:"حسین آباد جنگل"},{name:"حسین آباد رازون"},{name:"حسین آباد رحیم خان"},{name:"حسین آباد سرجام"},{name:"حسین آباد شامکان"},{name:"حسین آباد قرقی"},{name:"حسین آباد کاریون"},{name:"حسین آباد میرزامومن"},{name:"حسین آباد ناوی"},{name:"حسینی"},{name:"حصارتربت حیدریه"},{name:"حصارزبرخان"},{name:"حصارسرخ سرآسیاب سوران"},{name:"حصارمشهد"},{name:"حکم آباد"},{name:"حکیم آباد"},{name:"حوض سرخ"},{name:"خانکوک"},{name:"خانلق"},{name:"خانیک بشرویه یگی"},{name:"خانیک گناباد"},{name:"خرسف"},{name:"خرگرد"},{name:"خرم آباد تربت جام"},{name:"خرم آباد سبزوار"},{name:"خرم آباد قوچان"},{name:"خرم عمادیه"},{name:"خرمبک سه چوب"},{name:"خروعلیا"},{name:"خسروآباد"},{name:"خسروجرد"},{name:"خضربیگ"},{name:"خلیل آباد"},{name:"خمارتاش"},{name:"خواف"},{name:"خور بیجورد"},{name:"خوشدره"},{name:"خیرآباد تایباد"},{name:"خیرآباد تربت جام"},{name:"خیرآباد تربت حیدریه"},{name:"خیرآباد خواف"},{name:"خیرآباد سبزوار"},{name:"داغدار"},{name:"داغیان"},{name:"دافی"},{name:"داودلی"},{name:"داورزن"},{name:"درازآب تربت جام"},{name:"درخت بید"},{name:"دررود"},{name:"درزآب فردوس"},{name:"درفک"},{name:"درگز"},{name:"درونه"},{name:"دزق"},{name:"دستجردآقابزرگ"},{name:"دستجردطاقانکوه"},{name:"ده امام"},{name:"ده برزو"},{name:"ده پائین"},{name:"ده سرخ"},{name:"ده غیبی مشهد"},{name:"ده میان"},{name:"دهبار"},{name:"دهرود گرجی سفلی"},{name:"دهنوتلخی"},{name:"دوغ آباد"},{name:"دوغائی"},{name:"دولت آباد تربت جام"},{name:"دولت آباد تربت حیدریه"},{name:"دولت آباد رشتخوار"},{name:"دولت آباد سبزوار"},{name:"دولت آباد قوچان"},{name:"دوین چنارسوخته"},{name:"دیزادیز کچلانلو"},{name:"دیزباد"},{name:"دیزبادعلیا"},{name:"دیسفان"},{name:"دیش دیش"},{name:"رئیسی"},{name:"رادکان"},{name:"رامشین"},{name:"راه چمن"},{name:"راوخ"},{name:"رباط جز"},{name:"رباط سرپوش"},{name:"رباط سفید"},{name:"رباط سمنگان"},{name:"رباط سنگ"},{name:"رحمت آباد تربت جام"},{name:"رحمت آباد سبزوار"},{name:"رحمت آباد فردوس"},{name:"رخنه گل"},{name:"رزدآب"},{name:"رزق آباد"},{name:"رزگ"},{name:"رشتخوار"},{name:"رضوان"},{name:"رقه"},{name:"رکن آباد"},{name:"رهن"},{name:"رهن کاریز کفکی"},{name:"روچی"},{name:"روح آباد تربت حیدریه"},{name:"روح آباد نیشابور"},{name:"رودخانه"},{name:"رودمعجن"},{name:"روشن آباد"},{name:"روشناوند"},{name:"رونج"},{name:"ریاب"},{name:"ریگان"},{name:"ریگی زمه"},{name:"ریوش"},{name:"ریوند"},{name:"زاوه"},{name:"زاوین"},{name:"زرقان"},{name:"زرکک"},{name:"زرمهر"},{name:"زشک"},{name:"زمند"},{name:"زنگانلو"},{name:"زهان"},{name:"زورآباد"},{name:"زیبد"},{name:"زیدانلو"},{name:"زیرآباد"},{name:"زیرجان"},{name:"زیرک آباد"},{name:"زین آباد"},{name:"زیندانلو"},{name:"ژرف"},{name:"سارمران"},{name:"ساق"},{name:"ساقی بیک"},{name:"سالارآباد"},{name:"سالاری"},{name:"سبزوار"},{name:"سده خواف"},{name:"سرآسیاب"},{name:"سربالا"},{name:"سرچاه"},{name:"سرحوضک"},{name:"سرخ آباد"},{name:"سرخس"},{name:"سردشت"},{name:"سردق"},{name:"سرغایه"},{name:"سرک"},{name:"سرگلان"},{name:"سرند"},{name:"سرهنگ"},{name:"سروآباد بازمرگی"},{name:"سریده"},{name:"سعادت آباد"},{name:"سعدالدین"},{name:"سعدیه"},{name:"سفیدسنگ"},{name:"سقی"},{name:"سلامی"},{name:"سلطان آباد"},{name:"سلطان آبادسبزوار"},{name:"سلطان آبادنمک"},{name:"سلطان میدان"},{name:"سلمان خلیل آباد"},{name:"سلوگرد"},{name:"سلیمانی مشهد"},{name:"سلیمانی نیشابور"},{name:"سملخون"},{name:"سمیع آباد"},{name:"سنقرآباد"},{name:"سنگ بست"},{name:"سنگان بالا"},{name:"سنگان پائین"},{name:"سنگر"},{name:"سنگل آباد"},{name:"سنو"},{name:"سهل آباد"},{name:"سوران"},{name:"سورستان"},{name:"سویز"},{name:"سیجاوند"},{name:"سیدآبادچناران"},{name:"سیدآبادسبزوار"},{name:"سیدآبادنیشابور"},{name:"سیر"},{name:"سیف آباد"},{name:"سیوکی"},{name:"شاداب"},{name:"شادمهر"},{name:"شارک"},{name:"شامکان"},{name:"شاندیز"},{name:"شاهرگ"},{name:"شاهین علیا"},{name:"شترک"},{name:"ششتمد"},{name:"شعبه"},{name:"شغل آباد"},{name:"شفیع"},{name:"شفیع آباد"},{name:"شم آباد"},{name:"شمس آبادتربت حیدریه"},{name:"شمس آبادسبزوار"},{name:"شهرآباد بردسکن"},{name:"شهرآباد نیشابور"},{name:"شهرستانک"},{name:"شهرصنعتی سبزوار"},{name:"شهرطوس"},{name:"شهرفیروزه"},{name:"شهرک صنعتی کاشمر"},{name:"شهرک صنعتی کاویان"},{name:"شهرک امام خمینی"},{name:"شهرک خواف"},{name:"شهرک رضوی"},{name:"شهرک صنعتی طوس"},{name:"شهرک صنعتی کلات"},{name:"شهرکهنه"},{name:"شهن آباد"},{name:"شهوار"},{name:"شهید هنرمند"},{name:"شوراب"},{name:"شوررود"},{name:"شورستان"},{name:"شورگشت"},{name:"شوری بزرگ رشیدآباد"},{name:"شوریاب"},{name:"شوی"},{name:"شیخ لو"},{name:"شیرتپه"},{name:"شیرخان"},{name:"شیلیگان"},{name:"صالح آباد"},{name:"صدخرو"},{name:"صفی آباد"},{name:"صمدیه"},{name:"صنوبر"},{name:"صومعه"},{name:"صیدآباد"},{name:"طالبی"},{name:"طبس"},{name:"طرسک"},{name:"طرق"},{name:"طرقبه"},{name:"ظاهرآبادبردسکن"},{name:"عارف آباد"},{name:"عباس آباد"},{name:"عباس آبادخواف"},{name:"عباس آبادفرامیشان"},{name:"عباس آبادملک"},{name:"عبدآباد"},{name:"عبداله آبادنیشابور"},{name:"عبداله گیو"},{name:"عبدل آباد"},{name:"عبدل آبادسبزوار"},{name:"عبس آباد"},{name:"عزیزآباد"},{name:"عسگریه"},{name:"عشرت آباد ممرآباد"},{name:"عشق آبادفریمان"},{name:"عشق آبادنیشابور"},{name:"عطائیه"},{name:"عظیم آباد"},{name:"علاقه"},{name:"علی آباد خواف"},{name:"علی آباددامن"},{name:"علی آبادسیاسک"},{name:"علی آبادشور"},{name:"علی آبادفیض آباد"},{name:"علی آبادقوچان"},{name:"علی آبادکشمر"},{name:"علیک تربت حیدریه"},{name:"علیک سبزوار"},{name:"عمارت"},{name:"عنبرسرا"},{name:"غنی آباد"},{name:"فاردق"},{name:"فاز"},{name:"فایندر"},{name:"فتح آبادارسک"},{name:"فتح آبادتربت حیدریه"},{name:"فتح آبادفردوس"},{name:"فخرآبادتربت حیدریه"},{name:"فخرآبادفردوس"},{name:"فخرداود"},{name:"فدافن"},{name:"فدرد"},{name:"فدیشه"},{name:"فدیهه"},{name:"فراشیان"},{name:"فرخار"},{name:"فرخان"},{name:"فرخد"},{name:"فرخک"},{name:"فردوس"},{name:"فرزنه"},{name:"فرشه"},{name:"فرگ"},{name:"فرمان آباد"},{name:"فرهادگرد"},{name:"فریزی"},{name:"فریمان"},{name:"فریمانه"},{name:"فسنقر"},{name:"فهندر"},{name:"فودنجان"},{name:"فوشنجان"},{name:"فیض آبادتربت حیدریه"},{name:"فیض آبادداورزن"},{name:"قادرآباد"},{name:"قازان بیک"},{name:"قازقان"},{name:"قاسم آباد بزرگ"},{name:"قاسم آباد دهنه"},{name:"قاسم آباد فردوس"},{name:"قاسم آبادتربیت حیدریه"},{name:"قدمگاه"},{name:"قراچه"},{name:"قره باغ فیروزه"},{name:"قره شاه وردی"},{name:"قره قلی"},{name:"قره قویونلو"},{name:"قزل قارشی"},{name:"قصون"},{name:"قطن آباد"},{name:"قلعه آقاحسن"},{name:"قلعه باخزر"},{name:"قلعه بالا"},{name:"قلعه جوق"},{name:"قلعه سرخ باخرز"},{name:"قلعه سرخ تربت جام"},{name:"قلعه شیر"},{name:"قلعه گک"},{name:"قلعه نو شفیع آباد"},{name:"قلعه نوجمشید"},{name:"قلعه نوروداب"},{name:"قلعه نوصفی آباد"},{name:"قلعه نوکلات"},{name:"قلعه نومشهد"},{name:"قلعه نی"},{name:"قلعه یزدان"},{name:"قلندرآباد"},{name:"قله زو"},{name:"قوچ پلنگ"},{name:"قوچان"},{name:"قوژدفردوس"},{name:"قوش خزاعی"},{name:"قوش سربوزی"},{name:"قوش عظیم"},{name:"قیاص آباد"},{name:"کاخک"},{name:"کارخانه قند فریمان"},{name:"کارخانه قندجوین"},{name:"کاریز"},{name:"کاریزحاج محمدجان"},{name:"کاریزک خلیل آباد"},{name:"کاریزک ناگهانی"},{name:"کاریزکهندل"},{name:"کاریزنو"},{name:"کاسف"},{name:"کاشمر"},{name:"کاظم آباد"},{name:"کافج"},{name:"کال چغوکی"},{name:"کال زرکش"},{name:"کال شور تپه خان"},{name:"کالوکلات"},{name:"کامه علیا"},{name:"کاهه"},{name:"کاهوچناران"},{name:"کاهودرگز"},{name:"کاهیجه"},{name:"کبودان"},{name:"کت"},{name:"کته شمشیرسفلی"},{name:"کته شمشیرعلیا"},{name:"کچولی"},{name:"کدکن"},{name:"کراب"},{name:"کرات"},{name:"کردیان"},{name:"کرناوه شیرین"},{name:"کرند"},{name:"کریز"},{name:"کریم آباد"},{name:"کریم آبادکلات"},{name:"کسرینه"},{name:"کسکن"},{name:"کشکک"},{name:"کلات"},{name:"کلات نادر"},{name:"کلاته اله نظر"},{name:"کلاته بزرگ"},{name:"کلاته پایه"},{name:"کلاته زنگنه"},{name:"کلاته شادی"},{name:"کلاته صوفی"},{name:"کلاته عرب"},{name:"کلاته علی زینل"},{name:"کلاته مزینان"},{name:"کلاته ملامحمد قاچکانلو"},{name:"کلاته میمری"},{name:"کلاته نو"},{name:"کلاته نوبهار"},{name:"کلوخی"},{name:"کلیدر"},{name:"کمیز"},{name:"کندرخلیل آباد"},{name:"کندکلی"},{name:"کنگ"},{name:"کنگ علیا"},{name:"کنه بیست"},{name:"کهنه"},{name:"کهنه فرود"},{name:"کورده"},{name:"کوشه بردسکن"},{name:"کوشه کوه سرخ"},{name:"کوه آباد"},{name:"کوه سخت"},{name:"کوه سفید"},{name:"کیذور"},{name:"گراخک"},{name:"گرماب تربت حیدریه"},{name:"گرماب نیشابور"},{name:"گرو"},{name:"گرینه"},{name:"گستج"},{name:"گلبهار"},{name:"گلبو"},{name:"گلسرا"},{name:"گلمکان"},{name:"گمرک دوغارون"},{name:"گناباد"},{name:"گنبدلی"},{name:"گوارشک"},{name:"گوجه"},{name:"گوجی"},{name:"گوش لاغر"},{name:"گیسور"},{name:"لائین نو"},{name:"لطف آبادقوچان"},{name:"لطف آبادنیشابور"},{name:"ماروسک"},{name:"ماریان"},{name:"مایان"},{name:"مجتمع فولاد نیشابور"},{name:"مچ"},{name:"محسن آباد"},{name:"محمدآبادتربت جام"},{name:"محمدآبادرشتخوار"},{name:"محمدآبادقوچان"},{name:"محمدآبادگفت"},{name:"محمدتقی بیگ"},{name:"محمودآبادسفلی"},{name:"محمودآبادعلیا"},{name:"مرزان فهنه"},{name:"مرغزار"},{name:"مرندیز"},{name:"مزار"},{name:"مزداوند"},{name:"مزرج"},{name:"مزینان"},{name:"مژن آباد"},{name:"مشکان"},{name:"مشهد"},{name:"مشهدریزه"},{name:"مظفرآباد"},{name:"معدن سنگان"},{name:"معدن فیروزه"},{name:"معدن زغال سنگ"},{name:"مغان"},{name:"مقصودآباد"},{name:"مقیسه"},{name:"مکی"},{name:"ملک آبادتربت حیدریه"},{name:"ملک آبادمشهد"},{name:"ملوند"},{name:"ممیزآب تربت جام"},{name:"منصوری"},{name:"مهدی آبادرشتخوار"},{name:"مهدی آبادکاشمر"},{name:"مهر"},{name:"مهرآباد"},{name:"مهران کوشک"},{name:"مهنه"},{name:"مهوید"},{name:"موچنان"},{name:"موسی آباد"},{name:"موشک"},{name:"مومن آباد"},{name:"میاب"},{name:"میامی"},{name:"میاندهی فریمان"},{name:"میاندهی فیض آباد"},{name:"میرآباد"},{name:"ناظریه"},{name:"نامق"},{name:"نامن"},{name:"نای"},{name:"نریمانی"},{name:"نزل آباد"},{name:"نسر"},{name:"نشتیفان"},{name:"نصرآباد"},{name:"نصیرآباد"},{name:"نقاب تربت حیدریه"},{name:"نقاب سبزوار"},{name:"نقندر"},{name:"نهالدان"},{name:"نوبهار"},{name:"نوخندان"},{name:"نوده انقلاب"},{name:"نوده پشنگ"},{name:"نوده تربت جام"},{name:"نوده بیهود"},{name:"نودهان"},{name:"نوروزآباد"},{name:"نوسرانومیری"},{name:"نوق تربت حیدریه"},{name:"نوق فردوس"},{name:"نیازآباد"},{name:"نیرآباد توزنده جان کهنه ونو"},{name:"نیشابور"},{name:"نیگنان"},{name:"نیل آباد"},{name:"هاشم آباد"},{name:"هدایت آباد"},{name:"هدک سربرج"},{name:"هزارخوشه"},{name:"هفت خانه"},{name:"همائی"},{name:"همت آبادتربت جام"},{name:"همت آبادزمانی"},{name:"همت آبادشهرکهنه"},{name:"همت آبادفیض آباد"},{name:"هندل آباد"},{name:"ویرانی"},{name:"یادگار"},{name:"یاس تپه"},{name:"یاقوتین"},{name:"یحیی آباد"},{name:"یدک"},{name:"یک لنگی علیا"},{name:"یکه پسته"},{name:"یکه توت"},{name:"ینگجه"},{name:"ینگه قلعه شمس"},{name:"یوسفخان"},{name:"یونسی"}]
        },
        { name:  "خراسان شمالی ۰۵۸", eng: "Khorasan North 058"},
        { name:  "خوزستان ۰۶۱", eng: "Khuzestan 061"},
        { name:  "زنجان ۰۲۴", eng: "Zanjan 024"},
        { name:  "سمنان ۰۲۳", eng: "Semnan 023"},
        { name:  "سیستان و بلوچستان ۰۵۴", eng: "Sistan-Baluchestan 054"},
        { name:  "فارس ۰۷۱", eng: "Fars 071"},
        { name:  "قزوین ۰۲۸", eng: "Qazvin 028",

          cities : [{name:"آبگرم"},{name:"آبیک"},{name:"آراسنج"},{name:"آقابابا"},{name:"آک"},{name:"آلتین کش"},{name:"آمادگاه آبیک"},{name:"آوان"},{name:"آوج"},{name:"ابراهیم آباد"},{name:"ارتش آباد"},{name:"ارداق"},{name:"اردلان"},{name:"اروان"},{name:"اسپیک"},{name:"استلج"},{name:"اسفرورین"},{name:"اسلام آباد اقبالیه"},{name:"اسماعیل آباد"},{name:"اسماعیل آباد بوئین زهرا"},{name:"اکوجان  وشته"},{name:"الولک"},{name:"امیرآباد کهنه"},{name:"امیرآبادنو"},{name:"انداق"},{name:"اورکن کرد"},{name:"اورنه"},{name:"برزلجین"},{name:"بکندی"},{name:"بوئین زهرا"},{name:"بوئینگ بشر"},{name:"بیدستان"},{name:"پارسپانج"},{name:"پاورس"},{name:"پریجان"},{name:"پناه آباد"},{name:"پیریوسفیان"},{name:"تاکستان"},{name:"چسکین"},{name:"چناسک"},{name:"چنگوره"},{name:"چوبین در"},{name:"چوزه"},{name:"حاجی تپه"},{name:"حسن آباد سادات"},{name:"حسن آباد کلج"},{name:"حسین آباد"},{name:"حسین آباد بوئین زهرا"},{name:"حصارخروان"},{name:"حصارولیعصر"},{name:"حیدریه"},{name:"خاتون آباد"},{name:"خاک علی"},{name:"خرم آباد"},{name:"خرم پشته"},{name:"خرمن سوخته"},{name:"خطایان"},{name:"خورهشت"},{name:"خوزنین"},{name:"خونان"},{name:"خیارج"},{name:"داغلان"},{name:"داکان  رادکان"},{name:"دانسفهان"},{name:"دستجردتاکستان"},{name:"دستجردعلیا"},{name:"دشتک"},{name:"دولت آباد"},{name:"دیال آباد"},{name:"دیزج"},{name:"دیکین"},{name:"رازمیان"},{name:"رامشان"},{name:"رجائی دشت"},{name:"رحمت آباد"},{name:"رحیم آباد بوئین زهرا"},{name:"رحیم آباد تاکستان"},{name:"رزجرد"},{name:"رشتقون"},{name:"رودک"},{name:"زرجه بستان"},{name:"زواردشت  زرآباد"},{name:"زیاران"},{name:"زیباشهر محمدیه"},{name:"زین آباد"},{name:"ساج"},{name:"سعیدآباد"},{name:"سگزآباد"},{name:"سولیقان"},{name:"سیاهپوش"},{name:"سیردان"},{name:"شادمیان"},{name:"شارد"},{name:"شال"},{name:"شامی شاپ"},{name:"شاهین تپه"},{name:"شترک ماخورین"},{name:"شریف آباد"},{name:"شفیع آباد باراجین"},{name:"شنستق علیا"},{name:"شهرستانک"},{name:"شهرصنعتی  البرز الوند"},{name:"شهرک  شهید بهشتی"},{name:"شهرک صنعتی  آراسنج"},{name:"شهیدآباد"},{name:"شیداصفهان"},{name:"شیزند"},{name:"شینقر"},{name:"صدرآباد"},{name:"صمغ آباد"},{name:"ضیاآباد"},{name:"طزرک"},{name:"طزرکش"},{name:"عباس آباد"},{name:"عبدل آباد"},{name:"عبدل آبادمرکزی"},{name:"عصمت آباد"},{name:"علی آباد"},{name:"فارسجین"},{name:"فارسیان"},{name:"فتح آباد"},{name:"فیض آباد"},{name:"قاسم آباد"},{name:"قدیم آباد"},{name:"قرقسین"},{name:"قزوین"},{name:"قشلاق"},{name:"قشلاق چرخلو"},{name:"قشلاق مرانلو"},{name:"قلعه هاشم خان"},{name:"قمیک بزرگ"},{name:"کامیشگان"},{name:"کلج"},{name:"کلنجین"},{name:"کمال آباد"},{name:"کندر"},{name:"کنشکین"},{name:"کوچار"},{name:"کورانه"},{name:"کوندج"},{name:"کوهگیرعلیا"},{name:"کوهین"},{name:"کهک"},{name:"گرمارود"},{name:"لوشکان"},{name:"مجتمع  لیا"},{name:"محمدآبادخررود"},{name:"محمودآبادعلمخانی"},{name:"محمودآبادنمونه"},{name:"مسعودآباد"},{name:"مشعلدار"},{name:"مشکین آباد"},{name:"معلم کلایه"},{name:"مندرآباد"},{name:"مهدی آباد"},{name:"میرپنجی"},{name:"ناصرآباد"},{name:"نجف آباد"},{name:"نرجه"},{name:"نصرت آباد"},{name:"نظام آباد"},{name:"نودوز"},{name:"نهاوند"},{name:"نیارج"},{name:"نیارک"},{name:"نیکوئیه"},{name:"وثوق آباد"},{name:"ورس"},{name:"ولازجرد"},{name:"ولدآباد"},{name:"هرائین علیا"},{name:"هفت سنگان"},{name:"همت آباد"},{name:"هیر"},{name:"یانس آباد"},{name:"یحی آباد"}]
        },
        { name:  "قم ۰۲۵", eng: "Qom 025",
          cities : [{name:"اسفید"},{name:"الویرآباد"},{name:"بیدهند"},{name:"پاچیان"},{name:"تاج خاتون"},{name:"جعفرآباد گازران"},{name:"جعفریه"},{name:"جمکران"},{name:"جنت آباد"},{name:"جنداب"},{name:"چاهک"},{name:"چشمه شور"},{name:"حاجی آباد شهید فهمیده"},{name:"حاجی آباد قنوات"},{name:"حسن آباد نیزار"},{name:"حسین آباد"},{name:"خاوه"},{name:"خدیجه خاتون"},{name:"دام شهر"},{name:"دستجردخلجستان"},{name:"دولت آباد"},{name:"دولت آباد طغرود"},{name:"دیزیجان"},{name:"راهجرد"},{name:"رستگان"},{name:"زواریان"},{name:"زیزگان"},{name:"سلفچگان"},{name:"سناوند"},{name:"سنجگان"},{name:"سیرو"},{name:"شهرک  صنعتی  سلفچگان"},{name:"شهرک  صنعتی  محمودآباد"},{name:"شهرک  مهدیه"},{name:"شهرک صنعتی  شکوهیه"},{name:"صرم  خورآباد"},{name:"طایقان"},{name:"علی آبادانقلاب"},{name:"علی آبادنیزار"},{name:"فردو"},{name:"قاهان"},{name:"قلعه الهیار"},{name:"قلعه چم"},{name:"قم"},{name:"قمرود"},{name:"کرمچکان"},{name:"کندرود"},{name:"کوه سفید"},{name:"کهک"},{name:"کهندان"},{name:"گیو عیسی آباد طینوج"},{name:"لنگرود"},{name:"مبارک آباد"},{name:"محمودآباد"},{name:"ملک قلعه"},{name:"موجان"},{name:"مهرزمین"},{name:"میم"},{name:"نایه"},{name:"نویس"},{name:"نیزار"},{name:"ورجان"},{name:"وسفونجرد"},{name:"وشنوه"},{name:"ونارج"},{name:"ونارد"},{name:"یکه باغ"}]
        },
        { name:  "کردستان ۰۸۷", eng: "Kurdistan 087",
          cities : [{name:"آرمرده"},{name:"آرندان"},{name:"آلمانه"},{name:"آلوت"},{name:"آونگان"},{name:"آویهنگ"},{name:"آیچی"},{name:"ابراهیم آباد"},{name:"اسلامدشت سقز"},{name:"الک"},{name:"انجمه"},{name:"اورامان"},{name:"ایرانخواه سقز"},{name:"بابارشانی"},{name:"باباریز"},{name:"بازارچه مرزی"},{name:"باشماق سقز"},{name:"باشماق سنندج"},{name:"باقرآباد"},{name:"بانه"},{name:"باینجوب"},{name:"برده رشه بانه"},{name:"برده رشه مریوان"},{name:"برقرو"},{name:"بسطام"},{name:"بلبان آباد"},{name:"بلبر"},{name:"بلدستی"},{name:"بوالحسن"},{name:"بوئین سفلی"},{name:"بوریدر"},{name:"بهارلو"},{name:"بیان لو"},{name:"بیجار"},{name:"بیساران"},{name:"پاپاله"},{name:"پالنگان"},{name:"پایگلان"},{name:"پشاباد"},{name:"پیرتاج"},{name:"تخته"},{name:"ترجان"},{name:"تموغه"},{name:"تنگی سر"},{name:"توپ آغاج"},{name:"تودارروته"},{name:"تودارملا"},{name:"توریور"},{name:"تومارقامیش"},{name:"جعفرآباد"},{name:"چشمه منتش"},{name:"چشمیدر"},{name:"چوروننه"},{name:"حسن آباد"},{name:"حسن آباد/یاسوکند"},{name:"حسن تیمور"},{name:"حسین آباد/سقز"},{name:"حسین آباد/سنندج"},{name:"خامسان"},{name:"خاندان قلی"},{name:"خسروآباد"},{name:"خورخوره"},{name:"خوری آباد"},{name:"دادانه"},{name:"دانیکش"},{name:"دربند"},{name:"درکی"},{name:"درگاه شیخان"},{name:"دری"},{name:"دزج"},{name:"دزلی"},{name:"دژن"},{name:"دگاگا"},{name:"دل"},{name:"دلبران"},{name:"دوشان"},{name:"دولاب"},{name:"دهگلان"},{name:"دیواندره"},{name:"دیوزند"},{name:"رشیدآباد"},{name:"زرینه"},{name:"زرینه ورمزیار"},{name:"زونج"},{name:"ژان"},{name:"ژنین"},{name:"ژیوار"},{name:"ساوان"},{name:"ساوجی"},{name:"سبدلو"},{name:"سرا"},{name:"سراب حاجی پمق"},{name:"سراب قامیش"},{name:"سرچشمه"},{name:"سرچی"},{name:"سرخه دزج"},{name:"سرداب"},{name:"سردوش"},{name:"سرریز"},{name:"سرنجیانه سفلی"},{name:"سرنجیانه قروه"},{name:"سروآباد"},{name:"سرهویه"},{name:"سریش آباد"},{name:"سقز"},{name:"سنته سقز"},{name:"سنگ سفید"},{name:"سنگین آباد"},{name:"سنندج"},{name:"سوته"},{name:"سیدان"},{name:"سیس"},{name:"شارانی"},{name:"شاهینی"},{name:"شریف آباد"},{name:"شریف کندی"},{name:"شکوه آباد"},{name:"شوی"},{name:"شویشه"},{name:"شهرصنعتی /سقز"},{name:"شیان"},{name:"شیروانه"},{name:"صاحب سقز"},{name:"صالح آباد"},{name:"صلوات آباد"},{name:"صوفیان"},{name:"طای"},{name:"عیسی آباد"},{name:"غارکرفتو"},{name:"فارس آباد"},{name:"قار"},{name:"قاملو"},{name:"قامیشله"},{name:"قباقلو"},{name:"قپلانتو"},{name:"قراگل"},{name:"قروه"},{name:"قره دره"},{name:"قزلجه کند"},{name:"قشلاق نوروز"},{name:"قصلان"},{name:"قلعه جغه"},{name:"قلعه جی"},{name:"قلعه روتله"},{name:"قلعه قروه"},{name:"قلندرگاه"},{name:"قلیان"},{name:"قلیچیان"},{name:"قورق"},{name:"قوری چای"},{name:"قهرآبادسفلی"},{name:"قهرآبادسلیمان"},{name:"قیلسون"},{name:"کامیاران"},{name:"کانی دینار"},{name:"کانی سور"},{name:"کرجو"},{name:"کروندان"},{name:"کره سی"},{name:"کسنزان"},{name:"کلاته"},{name:"کلده سوره"},{name:"کلکان"},{name:"کماله"},{name:"کنگره"},{name:"کوچک"},{name:"کول"},{name:"کوله ساره"},{name:"کهریزه"},{name:"کیلانه"},{name:"گردمیران سفلی"},{name:"گردمیران علیا"},{name:"گردنه /ایرانخواه"},{name:"گردنه /محمودآباد"},{name:"گردیگلان"},{name:"گل تپه سقز"},{name:"گلین"},{name:"گلیه"},{name:"گنجی"},{name:"گنداب علیا"},{name:"گواز"},{name:"گوشخانی"},{name:"لنج آباد"},{name:"لون سادات"},{name:"ماراب"},{name:"مالوجه"},{name:"ماهیدرسفلی"},{name:"محمده"},{name:"مرخز"},{name:"مریوان"},{name:"موچش"},{name:"مولان آباد"},{name:"میانه"},{name:"میدان غله"},{name:"میرده"},{name:"میره کی"},{name:"میهم سفلی"},{name:"میهم علیا"},{name:"نارنجک"},{name:"ناو"},{name:"نایسر"},{name:"نجف آباد"},{name:"نجنه"},{name:"نران"},{name:"نزار"},{name:"نژمار"},{name:"نساره علیا"},{name:"نسنار"},{name:"نشورسفلی"},{name:"نگل"},{name:"ننور"},{name:"نوره"},{name:"نی"},{name:"نیر"},{name:"وزمان"},{name:"وله ژیر"},{name:"وینسار"},{name:"ویهج"},{name:"هزارخانی"},{name:"هشمیز"},{name:"هفت اصحاب"},{name:"هندیمن"},{name:"هویه"},{name:"هیجانان"},{name:"یاپل"},{name:"یالقوزآغاج"},{name:"یمینان سفلی"},{name:"یورقل"}]
        },
        { name:  "کرمان ۰۳۴", eng: "Kerman 034"},
        { name:  "کرمانشاه ۰۸۳", eng: "Kermanshah 083",
          cities : [{name:"آئینه"},{name:"آب باریک"},{name:"آران"},{name:"ارمنی جان"},{name:"ازگله"},{name:"اسلام آباد غرب"},{name:"بابازید"},{name:"باریکه نظام"},{name:"بازارچه مرزی  پرویزخان"},{name:"بانه وره"},{name:"باوله  شهیدباهنر"},{name:"باینگان"},{name:"برناج"},{name:"بشیرآباد"},{name:"بلوردی"},{name:"بیدسرخ"},{name:"بیستون"},{name:"پاوه"},{name:"پتروشیمی آمونیاک"},{name:"پریوه"},{name:"تازه آباد ثلاث باباجانی"},{name:"تپه شعبان"},{name:"تمرگ هرسین"},{name:"توه سرخک"},{name:"جامه شوران"},{name:"جوانرود"},{name:"جوباغان"},{name:"جیحون آباد"},{name:"چرمله سفلی"},{name:"چشمه سفید"},{name:"چقاکبود"},{name:"چمه"},{name:"چنگور"},{name:"چورزی"},{name:"چهر"},{name:"حبشی"},{name:"حبیب وند"},{name:"حجیج"},{name:"حریر"},{name:"حسن آباد"},{name:"حسن آباد روانسر"},{name:"حمیل"},{name:"خپگه"},{name:"خسروآباد"},{name:"خسروی"},{name:"داریان"},{name:"درکه عین القاس"},{name:"دزآور"},{name:"دشه"},{name:"ده پهن"},{name:"دهلر"},{name:"رحمت آباد"},{name:"رحیم آباد"},{name:"روانسر"},{name:"ریجاب  بانمزاران"},{name:"زالوآب"},{name:"زردوئی"},{name:"زرده"},{name:"زلان"},{name:"ساتیاری"},{name:"سراب بیدسرخ"},{name:"سراب قلعه شاهین"},{name:"سراب نیلوفر"},{name:"سرابله"},{name:"سرباغ گلین"},{name:"سرپل ذهاب"},{name:"سردارآباد"},{name:"سرماج"},{name:"سرونو"},{name:"سریاس"},{name:"سطرسنقر"},{name:"سلطان آباد"},{name:"سلطان طاهر"},{name:"سنقر"},{name:"سوخورشهبازی"},{name:"سومار"},{name:"سهنله"},{name:"سیاه بیدعلیا"},{name:"سیاه چقا"},{name:"سیاه کمر"},{name:"سیدخلیل"},{name:"شادآباد"},{name:"شاهینی"},{name:"شروینه"},{name:"شمشیر"},{name:"شورآباد"},{name:"شورچه"},{name:"شهرک  شهید عسگری"},{name:"شهرک صنعتی  اسلام آباد"},{name:"شهرک صنعتی  روانسر"},{name:"شهرک صنعتی  فرامان"},{name:"شهرک صنعتی  کنگاور"},{name:"صحنه"},{name:"طاهرآبادصحنه"},{name:"طاهرآبادکنگاور"},{name:"علی آباد"},{name:"علی گرزان علیا"},{name:"فارسینج"},{name:"فرامان"},{name:"فش"},{name:"فشخوران"},{name:"قارلق"},{name:"قره بلاغ اعظم"},{name:"قزانچی"},{name:"قشلاق  منصورآقائی"},{name:"قصرشیرین"},{name:"قلعه شاهخانی"},{name:"قلعه شیان"},{name:"قلعه هرسم"},{name:"قمرالی"},{name:"قمشه"},{name:"قوری قلعه"},{name:"کارخانه"},{name:"کرکول کسان"},{name:"کرماجان"},{name:"کرمانشاه"},{name:"کرناچی"},{name:"کرندغرب"},{name:"کل کش"},{name:"کلال"},{name:"کلانتر"},{name:"کلاه دراز"},{name:"کلگاه زمان"},{name:"کله جوب"},{name:"کندوله"},{name:"کندهر"},{name:"کنگاور حسن آباد"},{name:"کوزران"},{name:"گاوچالی"},{name:"گاوکل"},{name:"گردکانه"},{name:"گردنگاه قوچمی"},{name:"گره بان"},{name:"گزنهله"},{name:"گواور"},{name:"گودین"},{name:"گورسفید"},{name:"گهواره"},{name:"گیلانغرب"},{name:"لیلمانج"},{name:"مارانگاز"},{name:"ماهیدشت"},{name:"مجتمع  کوئیک"},{name:"محمدی سفلی"},{name:"مرزبانی"},{name:"مومئی"},{name:"میانراهان"},{name:"میرآباد"},{name:"میله سر"},{name:"نروی"},{name:"نساردیره"},{name:"نودشه"},{name:"نوسود"},{name:"نهرابی"},{name:"ونائی"},{name:"هرسین"},{name:"هفت آشیان"},{name:"هلشی"}]
        },
        { name:  "کهگیلویه و بویراحمد ۰۷۴", eng: "Kohgiluyeh-Boyer-Ahmad 074",
          cities : [{name:"یاسوج"},{name:"آبجیرک"},{name:"آبدهگاه"},{name:"آبشیرین"},{name:"آبله"},{name:"آرو"},{name:"القچین"},{name:"الکن"},{name:"امامزاده  جعفر"},{name:"امامزاده  محمود"},{name:"انجیرسیاه"},{name:"ایدنک"},{name:"باباکلان"},{name:"باشت"},{name:"باگ"},{name:"بردیان"},{name:"بن زرد"},{name:"بناری"},{name:"بنستان"},{name:"بوستان"},{name:"بهرام بیگی"},{name:"بهره عنا"},{name:"بی بی حکیمه"},{name:"بی منجگان"},{name:"بیدک"},{name:"پاتاوه"},{name:"پادوک"},{name:"پاسداران  کاکان"},{name:"پشه کان"},{name:"پوله"},{name:"تلچگاه"},{name:"تلخاب شیرین"},{name:"تمنک"},{name:"تنگ سرخ"},{name:"تنگاری"},{name:"توت نده"},{name:"جاورده"},{name:"جنگلوا"},{name:"جوکار"},{name:"چاه تلخ"},{name:"چاه گرگی"},{name:"چرام"},{name:"چم بلبل"},{name:"چناربرم"},{name:"چنارستان"},{name:"چیتاب"},{name:"چیر"},{name:"چین"},{name:"حسین آباد دشتروم"},{name:"خان احمد"},{name:"خلیفه ای"},{name:"خیرآباد جلیل"},{name:"خیرآباد ناصر"},{name:"دارشاهی"},{name:"درب کلات"},{name:"دروهان"},{name:"دره کلالی"},{name:"دژسلیمان"},{name:"دشت بن"},{name:"دم مهد"},{name:"دوگنبدان  گچساران"},{name:"ده برآفتاب"},{name:"ده شیخ"},{name:"دهدشت"},{name:"دیشموک"},{name:"دیل"},{name:"راک"},{name:"راه مالی"},{name:"سادات مشهدی"},{name:"سپیدار"},{name:"سرآبننیز"},{name:"سرآبیز"},{name:"سرآسیاب یوسفی"},{name:"سراب تاوه"},{name:"سربیشه دهدشت"},{name:"سربیشه گچساران"},{name:"سرپری  چهارمه"},{name:"سرفاریاب"},{name:"سروک"},{name:"سعادت آباد"},{name:"سواری"},{name:"سوق"},{name:"سی سخت"},{name:"سیمرون  گورگنجو"},{name:"شهرک  ولیعصر"},{name:"ضرغام آباد"},{name:"طولیان"},{name:"فشیان"},{name:"فیروزآباد"},{name:"فیلگاه"},{name:"قلعه دختر"},{name:"قلعه رئیسی"},{name:"قلعه گل"},{name:"قلعه ممبی"},{name:"قیام"},{name:"کالوس"},{name:"کریک"},{name:"کلایه سفلی"},{name:"کمبل"},{name:"کوخدان"},{name:"کوشک ابول"},{name:"گچی"},{name:"گراب  لوداب"},{name:"گروس"},{name:"گنجه ای بزرگ"},{name:"لنده"},{name:"لیرتلخک"},{name:"لیشتر مظفرآباد"},{name:"لیکک  کت بهمئی"},{name:"مادوان  مهریان"},{name:"مارگون"},{name:"مارین"},{name:"مامازینب"},{name:"ماهورباشت"},{name:"مختار"},{name:"مزدک"},{name:"مله باریک"},{name:"مندان"},{name:"موشمی"},{name:"موگر"},{name:"میمند"},{name:"نازمکان"},{name:"نره گاه"},{name:"وزگ"},{name:"هادی آباد"}]
        },
        { name:  "گلستان ۰۱۷", eng: "Golestan 017",
          cities : [{name:"آب پران"},{name:"آبادان تپه"},{name:"آرخ بزرگ"},{name:"آزادتپه"},{name:"آزادشهر1"},{name:"آزادشهر2"},{name:"آق آباد"},{name:"آق امام"},{name:"آق زبیر"},{name:"آق قلا"},{name:"آق قمیش"},{name:"آقبند"},{name:"آقچلی سفلی"},{name:"آلتین تخماق"},{name:"آلوکلاته"},{name:"آهنگرمحله"},{name:"اجن شیرملی"},{name:"ارازگل"},{name:"اسلام تپه"},{name:"اصفهان کلاته"},{name:"اگری بوغاز"},{name:"امیرآباد گز"},{name:"امین آباد"},{name:"انبارآلوم"},{name:"انقلاب"},{name:"اوبه محمدایمر"},{name:"اوچ تپه"},{name:"اودک دوجی  حسن طبیب"},{name:"اونق یلقی"},{name:"ایتمر"},{name:"ایگدرسفلی"},{name:"ایگدرعلیا"},{name:"ایلوار"},{name:"ایمرملاساری"},{name:"اینچه برون"},{name:"باغلی مرامه"},{name:"باقرآباد"},{name:"بالاجاده"},{name:"بایلر"},{name:"بدراق نوری"},{name:"برفتان"},{name:"بصیرآباد"},{name:"بندر ترکمن"},{name:"بندر گز"},{name:"بهلکه داشلی"},{name:"بهلکه شیخ موسی"},{name:"بی بی شیروان"},{name:"پاسنگ بالا"},{name:"پنج پیکر"},{name:"پیراوش سفلی"},{name:"پیش کمر"},{name:"تاتارسفلی"},{name:"تاتارعلیا"},{name:"تاش ده"},{name:"تخت"},{name:"تخشی محله"},{name:"تراجیق"},{name:"تقی آباد"},{name:"تمرقره قوزی"},{name:"تنگراه"},{name:"توران ترک"},{name:"توران فارس"},{name:"تورنگ تپه"},{name:"توسکستان"},{name:"تیل آباد"},{name:"جلین علیا"},{name:"جهان آباد"},{name:"چارقلی"},{name:"چپق لقی"},{name:"چناران"},{name:"چنارلی"},{name:"چهارباغ"},{name:"چهارده"},{name:"چین سبیلی"},{name:"حاجی آباد"},{name:"حاجی بیک علیا"},{name:"حاجی قوشان"},{name:"حاجی کلاته"},{name:"حالی آخوند"},{name:"حکیم آباد"},{name:"حیدرآباد گرگان"},{name:"حیدرآباد گنبدکاووس"},{name:"خانببین"},{name:"خواجه لر"},{name:"خواجه نفس"},{name:"خوش یلاق"},{name:"دارکلاته"},{name:"داشلی برون"},{name:"دلند"},{name:"دنگلان"},{name:"دوزالوم"},{name:"دوزین"},{name:"دوگنجی"},{name:"ده چناشک"},{name:"دهنه"},{name:"دیگچه  سرگچن"},{name:"رادکان"},{name:"رامیان"},{name:"رضاآباد"},{name:"رودبارقشلاق"},{name:"زندانچال"},{name:"زنگیان"},{name:"زیارت"},{name:"زینب آباد"},{name:"سارجه کر"},{name:"سارلی سفلی"},{name:"سارلی علیا"},{name:"سالیکنده"},{name:"سدن  سیدمیران"},{name:"سرخن کلاته"},{name:"سرطاق"},{name:"سرکلاته"},{name:"سعدآباد"},{name:"سقرتپه"},{name:"سلاق غایب"},{name:"سلاق نوری"},{name:"سلطان آباد"},{name:"سلطانعلی"},{name:"سنگ دوین"},{name:"سوزش"},{name:"سوسرا"},{name:"سیجوال"},{name:"سیدآباد"},{name:"شاهکوه سفلی"},{name:"شاهکوه علیا"},{name:"شفت آلوباغ"},{name:"شموشک سفلی"},{name:"شورحیات"},{name:"شهرک صنعتی  آق قلا"},{name:"شهرک صنعتی  بندر گز"},{name:"شیرآباد"},{name:"شیرنگ"},{name:"صادق آباد"},{name:"صحنه سفلی"},{name:"صفی آباد"},{name:"صوفی شیخ دازغراوی"},{name:"صوفیان"},{name:"عرب بوران"},{name:"عرب سرنگ"},{name:"عرب قاری حاجی"},{name:"عزیزآباد"},{name:"عطاآباد"},{name:"علی آباد"},{name:"علی آباد کتول"},{name:"علی آبادکنارشهر"},{name:"فارسیان  قانچی"},{name:"فارسیان فرنگ"},{name:"فاضل آبادگرگان"},{name:"فاضل آبادگنبدکاووس"},{name:"فجر قوینلی"},{name:"فوجرد"},{name:"قارقی بناور"},{name:"قانقرمه"},{name:"قپان"},{name:"قدونه"},{name:"قربان آباد"},{name:"قرق"},{name:"قرن آباد"},{name:"قرناوه"},{name:"قرنجیک پورامان"},{name:"قرنجیک نظر"},{name:"قره بلاغ"},{name:"قره تپه"},{name:"قره چشمه"},{name:"قره سو"},{name:"قره شور"},{name:"قره قاشلی"},{name:"قره ماخر"},{name:"قزلجه آق امام"},{name:"قزلی"},{name:"قلعه جیق"},{name:"قلعه قافه"},{name:"قلعه محمود"},{name:"قلمی"},{name:"قلی آباد"},{name:"قوچ مراد"},{name:"قورچای"},{name:"قوشجان آباد"},{name:"قوشه سو"},{name:"قول حاجی"},{name:"کارکنده  سوته"},{name:"کاشیدار"},{name:"کاکا"},{name:"کردکوی"},{name:"کرند"},{name:"کریم آباد"},{name:"کسکن قوجق"},{name:"کفشگیری"},{name:"کلاجان قاجار"},{name:"کلاسره"},{name:"کلاله"},{name:"کماسی"},{name:"کنگور"},{name:"کوچک خرطوم"},{name:"کوچک نظرخانی"},{name:"گالیکش"},{name:"گرجی محله  سفیدآباد"},{name:"گرگان"},{name:"گری دوجی"},{name:"گلها حاجی نبی"},{name:"گلیداغ"},{name:"گمرک پل  تنگلی"},{name:"گمیشان"},{name:"گنبدکاووس"},{name:"گوزن فارس"},{name:"لمسک  ورسن"},{name:"لیوان"},{name:"محمدآباد"},{name:"محمدزمان خان"},{name:"مراوه تپه"},{name:"مرزبان"},{name:"مرزن کلاته"},{name:"مزرعه کتول"},{name:"معصوم آباد"},{name:"ملاعلی تپه"},{name:"ملک علی تپه"},{name:"مهترکلاته"},{name:"میاندره"},{name:"میرزاعلی یلقی"},{name:"میرمحله  شمس آباد"},{name:"مینودشت"},{name:"نارلی داغ"},{name:"نراب"},{name:"نصرآباد"},{name:"نظام آباد"},{name:"نوچمن"},{name:"نوده خاندوز"},{name:"نوده ملک"},{name:"نودیجه"},{name:"نوکنده"},{name:"نومل"},{name:"وامنان"},{name:"وحدت"},{name:"وطن"},{name:"هاشم آباد"},{name:"هوتن"},{name:"یاسی تپه"},{name:"یامپی"},{name:"یساقی"},{name:"یل چشمه"},{name:"یلمه سالیان"},{name:"ینقاق"}]
        },
        { name:  "گیلان ۰۱۳", eng: "Gilan 013",
          cities : [{name:"آبکنار"},{name:"آج بوزایه"},{name:"آستارا"},{name:"آستانه اشرفیه"},{name:"آلیان"},{name:"آهندان"},{name:"اباتر"},{name:"احمدسرگوراب"},{name:"اردجان"},{name:"ارده"},{name:"ارشادمحله"},{name:"اژدهابلوچ"},{name:"اسالم  خلیفه آباد ناورود"},{name:"اسپند چکوور"},{name:"استخربیجار"},{name:"اسطلخ جان"},{name:"اسطلک"},{name:"اسفقن سر"},{name:"اسکولک"},{name:"اشکیک"},{name:"اطاق ور"},{name:"البرز جورکاسر"},{name:"امام  ده"},{name:"امامزاده  هاشم"},{name:"امشل"},{name:"املش"},{name:"امیرهنده"},{name:"انارستان"},{name:"اوشیان"},{name:"اولم"},{name:"ایزبرم"},{name:"ایوان استخر"},{name:"بارکوسرا"},{name:"بازقلعه اکبر"},{name:"باغچه سرا"},{name:"بالاخرطوم"},{name:"بالارودپشت  بین کلایه"},{name:"بداب"},{name:"بداغ محله"},{name:"برمچه قوام"},{name:"بره سر"},{name:"بلسبنه"},{name:"بلگور"},{name:"بندر انزلی"},{name:"بندر کیاشهر"},{name:"بهمبر"},{name:"بیجارکنار"},{name:"پاپکیاده"},{name:"پاشاکی بالامحله  پائین محله"},{name:"پاکده"},{name:"پرکاپشت"},{name:"پروش"},{name:"پره سر"},{name:"پشت مسار"},{name:"پشتیر"},{name:"پلکوه  پاچکنار"},{name:"پوشل"},{name:"پهمدان"},{name:"پیربازار"},{name:"پیرسرا"},{name:"پیرکلاچای"},{name:"پیرکوه"},{name:"پیش کنار"},{name:"پیشخان"},{name:"تازه آباد جنگاه"},{name:"تجن گوکه"},{name:"تش"},{name:"تطف رود"},{name:"تکی تازه آباد"},{name:"تمل شیرکوه"},{name:"تمیجان"},{name:"توتکابن"},{name:"تویسروندان"},{name:"تیسیه"},{name:"جلیدان"},{name:"جمال آباد"},{name:"جمعه بازار تولم شهر"},{name:"جوبن"},{name:"جوبنه"},{name:"جوپشت"},{name:"جورکویه"},{name:"جوکندان"},{name:"جیرده"},{name:"جیرکویه"},{name:"جیرگوابر"},{name:"جیرنده  عمارلو"},{name:"جیرهنده"},{name:"چابکسر"},{name:"چاپارخانه"},{name:"چاف"},{name:"چایجان"},{name:"چپرپرد"},{name:"چلکاسر"},{name:"چلوانسرا"},{name:"چماچاه"},{name:"چماقستان"},{name:"چمخاله"},{name:"چوبربندرانزلی"},{name:"چوبرشفت"},{name:"چورکوچان"},{name:"چوکا"},{name:"چوکام"},{name:"چولاب  ابراهیم سرا"},{name:"چهارده"},{name:"چهارمحل"},{name:"چیران"},{name:"حاجی بکنده"},{name:"حاجی سرا"},{name:"حسن بکنده"},{name:"حسن رود"},{name:"حسنعلی ده"},{name:"حویق"},{name:"حیران"},{name:"خاصه کول"},{name:"خاله سرا"},{name:"خرارود"},{name:"خراط محله"},{name:"خرجیگل"},{name:"خشک رودبار"},{name:"خشکبیجار"},{name:"خشکنودهان"},{name:"خطبه سرا"},{name:"خطیبان"},{name:"خمام"},{name:"خمیران"},{name:"خوشابر"},{name:"داخل"},{name:"دارباغ"},{name:"دارسرا"},{name:"دافچاه"},{name:"درگاه"},{name:"دستک"},{name:"دشتویل"},{name:"دعوی سرا"},{name:"دلچه"},{name:"دلیوندان"},{name:"دوبخشر"},{name:"دوگور"},{name:"دهشال"},{name:"دهگاه"},{name:"دیارجان"},{name:"دیزین"},{name:"دیلمان"},{name:"دیناچال"},{name:"راسته کنار بوئین"},{name:"رحیم آباد"},{name:"رستم آباد"},{name:"رشت"},{name:"رضامحله"},{name:"رضوانشهر"},{name:"رودبار"},{name:"رودبارسرا"},{name:"رودبنه"},{name:"رودپشت"},{name:"رودپیش"},{name:"رودسر"},{name:"روشن آبسر"},{name:"زیباکنار"},{name:"زیده"},{name:"سادات محله  صیدرمحله"},{name:"سالکده"},{name:"سالکویه"},{name:"سجیران  جیرکول"},{name:"سده"},{name:"سراجار"},{name:"سراوان"},{name:"سرچشمه"},{name:"سرشکه"},{name:"سروندان"},{name:"سسمس"},{name:"سطل سر"},{name:"سقالکسر"},{name:"سنگاچین"},{name:"سنگر"},{name:"سورکوه"},{name:"سه سار"},{name:"سیاه بیل  دیگه سرا"},{name:"سیاه خاله سر"},{name:"سیاه گوراب"},{name:"سیاه مزگی  توسه"},{name:"سیاهکل"},{name:"سیاهکل رود"},{name:"سیویر"},{name:"شادخال"},{name:"شاقاجی  اسلام آباد"},{name:"شالما"},{name:"شاندرمن"},{name:"شبخوسلات"},{name:"شرفشاده  کهنه رودپشت"},{name:"ششکل"},{name:"شفارود"},{name:"شفت"},{name:"شکارسرا"},{name:"شلمان"},{name:"شولم"},{name:"شهربیجار"},{name:"شهرستان"},{name:"شهرصنعتی  رشت"},{name:"شهرک صنعتی  صومعه سرا"},{name:"شیجان"},{name:"شیخ علی بست"},{name:"شیخ علی توسه"},{name:"شیخ علی کلایه"},{name:"شیخ محله  سیاه درویشان"},{name:"شیخ نشین"},{name:"شیرآباد"},{name:"شیرکوه"},{name:"صفرابسته"},{name:"صومعه سرا"},{name:"صیقلان ورزل"},{name:"ضیابر"},{name:"طارم سر"},{name:"طاسکوه"},{name:"طالب آباد"},{name:"طاهرگوراب"},{name:"طرازکوه"},{name:"طول لات"},{name:"عباس آباد"},{name:"علی آباد"},{name:"عنبران محله"},{name:"فتیده"},{name:"فخب"},{name:"فخرآباد"},{name:"فشتال"},{name:"فشتکه"},{name:"فشتم"},{name:"فلکده"},{name:"فومن"},{name:"قاسم آباد سفلی"},{name:"قاسم آباد علیا"},{name:"قاضیان"},{name:"قروق  جماکوه"},{name:"قلعه رودخان"},{name:"کارسیدان"},{name:"کاس احمدان"},{name:"کانرود"},{name:"کپورچال"},{name:"کتشال"},{name:"کته سرولات"},{name:"کته شصت"},{name:"کتیک"},{name:"کتیگر آقاسیدشریف"},{name:"کچلام"},{name:"کرفستان"},{name:"کسما"},{name:"کلاچاه دوم"},{name:"کلاچای  بی بالان"},{name:"کلرم"},{name:"کلشتر"},{name:"کلیشم"},{name:"کماچال"},{name:"کمامردخ"},{name:"کمساربزرگ"},{name:"کنارسر"},{name:"کنستان"},{name:"کوچصفهان"},{name:"کوچک محله"},{name:"کوچکام"},{name:"کوده  میانده"},{name:"کورنده"},{name:"کوزان"},{name:"کوشال"},{name:"کولیور"},{name:"کومله"},{name:"کویه علیا"},{name:"کیاسرا"},{name:"کیسم"},{name:"کینچاه"},{name:"گرکه رود"},{name:"گشت"},{name:"گفشه"},{name:"گل افزان  کلده"},{name:"گل رودبار"},{name:"گل سفید"},{name:"گلسر قاضده"},{name:"گنجه"},{name:"گوراب پس"},{name:"گوراب زرمیخ"},{name:"گوراب لیشاوندان  تازآباد"},{name:"گورابجوار"},{name:"گورابسر"},{name:"گوشلوندان"},{name:"گوفل"},{name:"گیلده"},{name:"گیلوادشتان"},{name:"گیله پرده سر"},{name:"لات لیل"},{name:"لاشک"},{name:"لاقان  مردخه"},{name:"لاهیجان"},{name:"لپوندان"},{name:"لسکوکلایه"},{name:"لشت نشا"},{name:"لشکاجان"},{name:"لفمجان"},{name:"لفوت بالا ماشک تهرانچی"},{name:"لله کا"},{name:"لنگرود"},{name:"لوخ"},{name:"لوشان"},{name:"لوکلایه"},{name:"لولمان فومن"},{name:"لولمان کوچصفهان"},{name:"لوندویل"},{name:"لیالستان"},{name:"لیچاه"},{name:"لیسار"},{name:"لیف شاگرد"},{name:"لیلاکوه"},{name:"لیموچاه"},{name:"ماسال"},{name:"ماسوله"},{name:"ماکلوان"},{name:"مالفجان"},{name:"مبارک آباد"},{name:"مرکیه"},{name:"مریدان"},{name:"مژده"},{name:"مژدهه"},{name:"ملسکام  خسروآباد"},{name:"منجیل"},{name:"میرمحله"},{name:"ناش  نوده"},{name:"ناصرکیاده"},{name:"نالکیاشهر"},{name:"ندامان"},{name:"نرکستان"},{name:"نشرودگل"},{name:"نصفی"},{name:"نصیرمحله"},{name:"نقره ده"},{name:"نوبیجارمحله"},{name:"نوخاله اکبری"},{name:"نوده لشت نشا"},{name:"نوده مرخال"},{name:"نوشر"},{name:"نوکاشت"},{name:"نوکنده"},{name:"نهزوم"},{name:"واجارگاه"},{name:"وردم"},{name:"ولدپشت مخ"},{name:"ویرمونی"},{name:"ویزنه"},{name:"ویسه رود"},{name:"ویشکا"},{name:"ویشکاننک"},{name:"هشتپر تالش"},{name:"هلوسرا"}]
        },
        { name:  "لرستان ۰۶۶", eng: "Lorestan 066"},
        { name:  "مازندران ۰۱۱", eng: "Mazandaran 011",
          cities : [{name:"آب اسک"},{name:"آبگرم"},{name:"آری"},{name:"آغوزبن بابل"},{name:"آغوزگله"},{name:"آکند/پنبه زارکتی"},{name:"آلاشت"},{name:"آلوکنده /حاجی محله"},{name:"آمل"},{name:"آهنگرکلا"},{name:"آهنگرکلا/شهدای /دابو/مرزنگو"},{name:"آهودشت"},{name:"آهی محله"},{name:"آیت محله"},{name:"ابوالحسن کلا"},{name:"ابوخیل ارطه"},{name:"اتو"},{name:"اجارستاق"},{name:"اجوارکلا"},{name:"احمدآباد/کلیج"},{name:"ارات بن"},{name:"ارضت"},{name:"ازباران"},{name:"ازنی"},{name:"اسب چین"},{name:"اسب شورپی"},{name:"اسبوکلا"},{name:"اسبوکلا/ولاشد"},{name:"استخرپشت"},{name:"اسرم /جامخانه"},{name:"اسکنده /وازیک"},{name:"اسکومحله /امامزاده عبداله"},{name:"اسلام آباد"},{name:"اطرب /بهزادکلا"},{name:"اکراسر"},{name:"المشیر"},{name:"اله رودبار"},{name:"اله شاه /علی آباد"},{name:"امام /ده"},{name:"امامزاده /قاسم"},{name:"امره"},{name:"امیرآباد"},{name:"امیرآباد/ایزدشهرشرقی"},{name:"امین آباد"},{name:"اناده"},{name:"انارمرز"},{name:"انجیلسی"},{name:"اندوار"},{name:"اندیکلا"},{name:"اوارد"},{name:"اوجاک"},{name:"اوجامحله"},{name:"اوجی آباد"},{name:"اورست /مالخواست"},{name:"اوزکلا"},{name:"اومال /بریجان"},{name:"اهلم /آزادمون"},{name:"ایثارده"},{name:"ایرا"},{name:"ایزدشهرمرکزی"},{name:"ایل وکلا"},{name:"ایوک /بورخیل"},{name:"ایول"},{name:"بائوده سفلی"},{name:"بائیکلا/شهیدآباد"},{name:"بابل"},{name:"بابل پشت"},{name:"بابلسر/دریاکنار/خزرشهر/باقرتنگه"},{name:"بادله"},{name:"بالااحمدچاله پی"},{name:"بالابازیار"},{name:"بالامیرکلا"},{name:"بانصرکلا"},{name:"بایجان"},{name:"بایع کلا"},{name:"برجنده /شرفتی"},{name:"برسه"},{name:"برگه"},{name:"برما"},{name:"بزمین آباد"},{name:"بشل /چاکسر"},{name:"بطاهرکلا"},{name:"بلده"},{name:"بندر/امیرآباد"},{name:"بنفشه ده"},{name:"بورخانی"},{name:"بولی کلا/درویش خیل"},{name:"بهشهر"},{name:"بهنمیر"},{name:"بیزکی"},{name:"بیشه بنه"},{name:"بیشه سر"},{name:"بیشه کلا"},{name:"پائین احمدچاله پی"},{name:"پائین کلا"},{name:"پاجی /میانا"},{name:"پاشاکلاآمل"},{name:"پاشاکلادودانگه"},{name:"پاشاکلاساری"},{name:"پاشاکلاکسلیان"},{name:"پاوند"},{name:"پردمه"},{name:"پردنگون"},{name:"پرکلا"},{name:"پل سفید"},{name:"پل کرات"},{name:"پلور"},{name:"پنبه چوله"},{name:"پنجاب"},{name:"پوروا"},{name:"پوست کلا"},{name:"پول"},{name:"پهناب"},{name:"پهنه کلا"},{name:"پی قلعه"},{name:"پیته نو"},{name:"پیچاکلا"},{name:"پیشنبور"},{name:"پیمود"},{name:"تازه آباد"},{name:"تازه آباد/سپاه"},{name:"تاکر"},{name:"تلمادره"},{name:"تلوک"},{name:"تمسک /سرخکلا"},{name:"تمل"},{name:"تنکابن /خرم آباد"},{name:"تنگه لته"},{name:"تیرکلا/ماچک پشت"},{name:"تیله نو"},{name:"جلیکان علیا"},{name:"جلیل آباد/کراتچال"},{name:"جنت رودبار"},{name:"جواهرده"},{name:"جوربند"},{name:"جویبار"},{name:"چاری"},{name:"چالکرود"},{name:"چالوس"},{name:"چالیسیو"},{name:"چرته"},{name:"چفته کلا"},{name:"چل"},{name:"چلمردی"},{name:"چلندر"},{name:"چمان"},{name:"چمستان"},{name:"چورت"},{name:"حاجی کلابزرگ"},{name:"حریث"},{name:"حسن آباد"},{name:"حسین آباد/لله مرز"},{name:"حسین آباد/لیتکو"},{name:"حمیدآباد"},{name:"حیرت"},{name:"خارکش"},{name:"خال خیل"},{name:"خانه دریا"},{name:"خانه سرمرز"},{name:"خجیرکلا"},{name:"خرم آباد"},{name:"خرماکلا"},{name:"خزرآباد"},{name:"خشت سر"},{name:"خشرودپی"},{name:"خشکرود"},{name:"خطیرکلا/باغدشت"},{name:"خلیل محله"},{name:"خورشید"},{name:"خیرود/مزگاه"},{name:"خیرودکنار/سیدعلی کیا"},{name:"خیره سر"},{name:"دارابکلا"},{name:"دارکلا"},{name:"دازمیرکنده"},{name:"دامیر/دینک"},{name:"درازکلا"},{name:"دراسرا"},{name:"درزی کلا/کریم کلا"},{name:"درزیکلاآخوندی"},{name:"درونکلای شرقی"},{name:"درونکلای غربی"},{name:"دلسم /ویسر"},{name:"دنگ پیا"},{name:"دنگ سرک"},{name:"دوک /زیلت"},{name:"دونا"},{name:"دونکوه"},{name:"دونه چال"},{name:"دونه سر"},{name:"دینارسرا"},{name:"دینان"},{name:"دیوا"},{name:"دیودشت"},{name:"دیوکلا"},{name:"رامسر"},{name:"رئیس آباد"},{name:"رئیس کلا"},{name:"رزکه"},{name:"رزن"},{name:"رستم رود/آکامشهرمخابراتی"},{name:"رستم رود/ایزدشهرغربی"},{name:"رستم کلا"},{name:"رسکت"},{name:"رکابدارکلا"},{name:"رکن کلا"},{name:"رمنت"},{name:"رودبار/اورطشت"},{name:"رودبست"},{name:"رودگر/پل سرا"},{name:"روشن آباد"},{name:"رویان"},{name:"ریحان آباد/ولمازو"},{name:"ریکنده"},{name:"رینه لاریجان"},{name:"زاغمرز"},{name:"زاهدکلا"},{name:"زرگرمحله /آرادکلا"},{name:"زرندین"},{name:"زرین آباد"},{name:"زوارده"},{name:"زیارت کلا"},{name:"زیدسفلی"},{name:"زیراب"},{name:"سائیچ محله"},{name:"ساروپسند"},{name:"ساری"},{name:"سرخ کریه"},{name:"سرخرود"},{name:"سرخکلا/شهرک /فرهنگیان"},{name:"سرکا"},{name:"سرکت"},{name:"سروکلا"},{name:"سعادت آباد"},{name:"سعیدآباد"},{name:"سفیداب"},{name:"سفیدتمشک"},{name:"سلطان محمدطاهر"},{name:"سلمان شهر"},{name:"سلمل"},{name:"سلیاکتی"},{name:"سلیمان آباد"},{name:"سما"},{name:"سمسکنده"},{name:"سنارسفلی"},{name:"سنگ تراشان"},{name:"سنگتاب"},{name:"سنگچال"},{name:"سنگده"},{name:"سوا"},{name:"سوتکلا/دادکلا"},{name:"سوته /فریدون کنار"},{name:"سوچلما"},{name:"سوربن /برارده"},{name:"سورک آمل"},{name:"سورک ساری"},{name:"سه کیله"},{name:"سیاهدشت"},{name:"سیدابوصالح"},{name:"سیدمحله"},{name:"شارقلت"},{name:"شاندشت /شنگلده /وانا"},{name:"شاه کتی"},{name:"شرفدارکلا"},{name:"شوبکلا/معلم کلا"},{name:"شورکا"},{name:"شومیا"},{name:"شهرک /صنعتی /ساری"},{name:"شهرک /نمک آبرود"},{name:"شهرک صنعتی /آمل"},{name:"شهرک صنعتی /بهشهر"},{name:"شهرک صنعتی /دانیال"},{name:"شهنه کلا"},{name:"شیخ محله"},{name:"شیرخوارکلا"},{name:"شیرکلا"},{name:"شیرگاه"},{name:"شیرود"},{name:"صاحبی"},{name:"صالحان"},{name:"صفرخیل /میارکلا"},{name:"صلاح الدین کلا/ونوش"},{name:"صنایع /چوب /کاغذساری"},{name:"طارسی کلا"},{name:"طالب آملی"},{name:"طبقده"},{name:"طوسکلا/سیاوشکلا"},{name:"طوقدار"},{name:"طوله سرا"},{name:"عالمکلا"},{name:"عالیکلاآهی"},{name:"عباس آباد"},{name:"عبداله آباد"},{name:"عرب خیل"},{name:"عزت الدین"},{name:"عزت /منوچهرکلا"},{name:"عزیزک"},{name:"عسگرآباد"},{name:"عظیمیه چالکش"},{name:"علویکلا"},{name:"علی آباد/آمل"},{name:"علی آباد/ساری"},{name:"علی آباد/عسگرخان"},{name:"عیسی خندق"},{name:"غریب محله"},{name:"فریدون کنار"},{name:"فریم"},{name:"فریمک"},{name:"فقیه آباد"},{name:"فلورد"},{name:"فولادکلا/پازوار"},{name:"فیروزکلاآمل"},{name:"فیروزکلاچالوس"},{name:"فیروزکنده"},{name:"قائم شهر"},{name:"قائمیه"},{name:"قادیکلاچهاردانگه"},{name:"قادیکلای بزرگ"},{name:"قراخیل"},{name:"قرتیکلا"},{name:"قره تپه"},{name:"قلعه پایان"},{name:"قلعه سر"},{name:"قلعه کش"},{name:"قلعه گردن"},{name:"کاردرکلا"},{name:"کاردگرمحله آمل"},{name:"کاردگرمحله بابل"},{name:"کارکنده"},{name:"کارمزد"},{name:"کاظم بیگی"},{name:"کاظم کلا"},{name:"کترا"},{name:"کتی لته"},{name:"کجور"},{name:"کردکلا/کوهی خیل"},{name:"کردیچال"},{name:"کرسب /مسکوپا"},{name:"کرسی"},{name:"کرفون"},{name:"کرکنار"},{name:"کشتله"},{name:"کشتی سازی /ایران صدرا"},{name:"کشکسرا"},{name:"کشکوه"},{name:"کلا"},{name:"کلارآباد"},{name:"کلاردشت /حسن کیف"},{name:"کلارستاق"},{name:"کلاگرده"},{name:"کلاگرمحله"},{name:"کلت"},{name:"کلوده"},{name:"کله بست"},{name:"کله مرز/رودپشت"},{name:"کله نو"},{name:"کلیج خیل"},{name:"کلیکسر"},{name:"کمانگربرسمنان"},{name:"کمانگرکلا"},{name:"کمربن"},{name:"کمرود"},{name:"کمیشان"},{name:"کنس مرز"},{name:"کنیم"},{name:"کورکورسر"},{name:"کوکده"},{name:"کوهپر"},{name:"کوهسارکنده"},{name:"کوهستان /آسیابسر"},{name:"کیاسرچهاردانگه"},{name:"کیاکلا"},{name:"گالشپل"},{name:"گاوان کلا/سیدکلا"},{name:"گاوبر"},{name:"گتاب"},{name:"گرسماسر"},{name:"گزنک"},{name:"گل علی آباد"},{name:"گلما"},{name:"گلندرود"},{name:"گلوگاه"},{name:"گلوگاه بندپی"},{name:"گله محله سیرجارون"},{name:"گلیجان"},{name:"گلین /چی لی لی سر"},{name:"گنج افروز"},{name:"گویتر"},{name:"گیله کلا/باریک آبسر"},{name:"لاجیم"},{name:"لاریم"},{name:"لاسم"},{name:"لاشک"},{name:"لالا"},{name:"لاویج"},{name:"لتاک"},{name:"لتینگان"},{name:"لرگان"},{name:"لشتو/لزربن"},{name:"لشکنار"},{name:"لله بند"},{name:"لمراسک /تیرتاش /سراج محله"},{name:"لنگر"},{name:"لیماک"},{name:"لیند"},{name:"ماکران"},{name:"ماهفروجک"},{name:"ماهفروزمحله"},{name:"متکازین"},{name:"محمدآباد"},{name:"محمدآباددودانگه"},{name:"محمودآباد"},{name:"مرزن آباد"},{name:"مرزیکلا/بابل کنار"},{name:"مرگاو"},{name:"مرمت"},{name:"مریج محله"},{name:"مزید"},{name:"مشک آباد"},{name:"معلم کلا"},{name:"ملک خیل"},{name:"منطقه اقتصادی /بندر/امیرآباد/"},{name:"موزیکله"},{name:"مهدی رجه"},{name:"میانده"},{name:"میانگله /چناربن"},{name:"میخران"},{name:"میخساز/کندلوس"},{name:"میررودپشت"},{name:"میناک"},{name:"ناحیه"},{name:"ناندل"},{name:"نانواکلا"},{name:"نج"},{name:"نسن"},{name:"نشتارود"},{name:"نشل"},{name:"نعمت آباد"},{name:"نکا"},{name:"نمار"},{name:"نوا"},{name:"نوائی محله"},{name:"نوذرآباد"},{name:"نور/علمده"},{name:"نوسر"},{name:"نوشهر"},{name:"نوشیروانکلا"},{name:"نیاک"},{name:"نیالا"},{name:"نیچکوه"},{name:"نیرس"},{name:"نیم ور"},{name:"واز"},{name:"ورازان"},{name:"ورسک"},{name:"ورکاده"},{name:"ورکلا/ورندان"},{name:"ورمتون"},{name:"وری"},{name:"وسطی کلاآمل"},{name:"وسطی کلاقائم شهر"},{name:"ولشکلا"},{name:"ولوجا"},{name:"ولوکلا"},{name:"ولی آباد"},{name:"ولیکرودپشت"},{name:"ولیکستان"},{name:"هچیرود/هرطه کلا"},{name:"هریکنده"},{name:"هشتل"},{name:"هلیدشت"},{name:"همراه روستائی /تنکابن /و/توابع"},{name:"همراه روستائی /چالوس /و/توابع"},{name:"همراه روستائی /چالوس /و/توابع"},{name:"همراه روستائی /رامسر/و/توابع"},{name:"همراه روستائی /نکا/و/توابع"},{name:"هولار"},{name:"یالرود"},{name:"یخکش"},{name:"یمچی متوریج"},{name:"یوش"}]
        },
        { name:  "مرکزی ۰۸۶", eng: "Markazi 086",
          cities : [{name:"آستانه"},{name:"آشتیان"},{name:"آق داش"},{name:"آلوسجرد"},{name:"آناج"},{name:"آوه"},{name:"ابراهیم آباد"},{name:"احمدآباد"},{name:"اراک"},{name:"ازنوجان"},{name:"استوه"},{name:"اسفندان"},{name:"اسکان"},{name:"اکبرآباد"},{name:"الویر"},{name:"امامزاده  عباس"},{name:"امان آباد"},{name:"امیرآباد"},{name:"اندیس"},{name:"ایبک آباد"},{name:"بازرجان"},{name:"بازنه"},{name:"باغ برآفتاب"},{name:"باقرآباد"},{name:"بالقلو"},{name:"بزیجان"},{name:"بصری"},{name:"پاکل"},{name:"پرندک"},{name:"تبرته"},{name:"تفرش"},{name:"تلخاب"},{name:"توره"},{name:"جاورسیان"},{name:"جلایر"},{name:"جلماجرد"},{name:"جیریا"},{name:"چشمه پهن"},{name:"چقاسیف آباد"},{name:"چلبی"},{name:"چهارچشمه  جوادیه"},{name:"چهرقان"},{name:"حسین آباد"},{name:"حشمتیه"},{name:"حصارفر"},{name:"حکیم آباد"},{name:"خاوه"},{name:"خرماباد"},{name:"خسروبیک"},{name:"خشکرود"},{name:"خمارباغی"},{name:"خمین"},{name:"خنجین"},{name:"خنداب"},{name:"خورهه"},{name:"خوگان"},{name:"خیرآباد"},{name:"داوودآباد"},{name:"دستجان"},{name:"دلیجان"},{name:"دودهک"},{name:"دوزج"},{name:"ده شیرخان"},{name:"ده نمک"},{name:"ده نوصمصام"},{name:"دهچال"},{name:"دهسد"},{name:"دیزآباد"},{name:"رازقان"},{name:"راونج"},{name:"راوه"},{name:"رباط ترک"},{name:"رباط مراد"},{name:"رباط میل"},{name:"ریحان"},{name:"زاویه"},{name:"ساروق"},{name:"سامان"},{name:"ساوه"},{name:"ستق"},{name:"سرسختی سفلی"},{name:"سرسختی علیا"},{name:"سقانلیق"},{name:"سلیم آباد"},{name:"سمقاور"},{name:"سورانه"},{name:"سوزان"},{name:"سیاوشان"},{name:"شازند"},{name:"شتریه"},{name:"شهابیه"},{name:"شهراب"},{name:"شهر صنعتی  کاوه  ساوه"},{name:"شهرصنعتی  ایبک آباد"},{name:"شهرصنعتی  دلیجان"},{name:"شهرصنعتی  فرمهین"},{name:"شهرک  صنعتی  خمین"},{name:"شهرک  مهاجران"},{name:"شهرک صنعتی  خیرآباد"},{name:"شهرک صنعتی  راونج"},{name:"شهسواران"},{name:"شهوه"},{name:"شیرین آباد"},{name:"صدرآباد"},{name:"ضامنجان"},{name:"ضیاآباد نورآباد"},{name:"طراران"},{name:"طرازناهید"},{name:"ظهیرآباد"},{name:"عزیزآباد"},{name:"عقیل آباد"},{name:"علیشار"},{name:"عنبرته"},{name:"غرق آباد"},{name:"غیاث آباد"},{name:"غینر"},{name:"غینرجه"},{name:"فراهان  فرمهین"},{name:"فرفهان"},{name:"فرنق"},{name:"فشک"},{name:"فوران"},{name:"قاسم آباد"},{name:"قاسم آباداراک"},{name:"قاسم آباد ساوه"},{name:"قالهر"},{name:"قدمگاه"},{name:"قره بنیاد"},{name:"قلعه کرد"},{name:"قورچی باشی"},{name:"کارچان"},{name:"کردیجان"},{name:"کرکان"},{name:"کزاز"},{name:"کمیجان"},{name:"کودزر"},{name:"گازران"},{name:"گرکان"},{name:"گل زردقلعه"},{name:"گوار"},{name:"لریجان"},{name:"لکان"},{name:"لنجرود"},{name:"مالمیر"},{name:"مامونیه  زرندیه"},{name:"مانیزان"},{name:"مجتمع  قطران"},{name:"مجدآبادکهنه"},{name:"محلات"},{name:"محمودآباد"},{name:"مرزیجران"},{name:"مزرعه نو"},{name:"مست وایجان"},{name:"مشهدالکوبه"},{name:"مشهد اردهال"},{name:"مصرقان"},{name:"مصلح آباد"},{name:"ملک آباد"},{name:"موچان"},{name:"میچان"},{name:"میشیجان"},{name:"میلاجرد"},{name:"نخجیروان"},{name:"نراق"},{name:"نقوسان"},{name:"نمک کور"},{name:"نوبران"},{name:"نورعلی بیک"},{name:"نهرمیان"},{name:"نیمه ور باقرآباد"},{name:"واران"},{name:"واشه"},{name:"ورآباد"},{name:"ورچه"},{name:"وسقونقان"},{name:"وفس"},{name:"هزاوه"},{name:"هستیجان"},{name:"هفته"},{name:"هندودر"},{name:"یاتان"},{name:"یل آباد"}]
        },
        { name:  "هرمزگان ۰۷۶", eng: "Hormozgan 076",
          cities : [{name:"آبشورک"},{name:"ابوموسی"},{name:"اسلام آباد"},{name:"انوه"},{name:"ایسین"},{name:"ایلود"},{name:"باسعیدو"},{name:"باغات"},{name:"برکه دوکا"},{name:"برنطین"},{name:"بست قلات"},{name:"بستانوبندرلنگه"},{name:"بستانه"},{name:"بستک"},{name:"بشاگرد"},{name:"بندر پل"},{name:"بندر جاسک"},{name:"بندر چارک"},{name:"بندر حسینه"},{name:"بندر حمیران"},{name:"بندر خمیر"},{name:"بندر شناس"},{name:"بندر کلاهی"},{name:"بندر کنگ"},{name:"بندر لنگه"},{name:"بندر معلم"},{name:"بندرتیاب"},{name:"بندرعباس"},{name:"بندرمقام"},{name:"بنذرک"},{name:"بوچیر"},{name:"بوستانو"},{name:"به ده"},{name:"بیسه"},{name:"بیکا"},{name:"پایانه  کامیونداران"},{name:"پدل"},{name:"پشته ایسین"},{name:"پی پشت"},{name:"تازیان بالا"},{name:"تازیان پائین"},{name:"تخت"},{name:"تدروئیه"},{name:"توکهور"},{name:"تیرور"},{name:"جائین"},{name:"جاسک کهنه"},{name:"جزیره  هرمز"},{name:"جغین"},{name:"جناح"},{name:"چاه اسماعیل"},{name:"چاه بنارد"},{name:"چاه مسلم"},{name:"چاهستان"},{name:"چاهو"},{name:"چراغ آباد"},{name:"چه چکور"},{name:"چهواز"},{name:"چیروئیه"},{name:"حاجی آباد"},{name:"حاجی خادمی"},{name:"حکمی"},{name:"حمیران گاوبندی"},{name:"خراجی"},{name:"خورگو"},{name:"خیرآباد"},{name:"داربست"},{name:"درگهان"},{name:"درگیر"},{name:"دژگان"},{name:"دشت آشکارا"},{name:"دشتی"},{name:"دمشهر"},{name:"دولاب"},{name:"دهتل"},{name:"دهستان"},{name:"دهنگ"},{name:"دهنوپائین"},{name:"دهو"},{name:"دیرستان"},{name:"دیوان"},{name:"راونگ"},{name:"رستاق"},{name:"رضوان"},{name:"رمچاه"},{name:"رمکان"},{name:"روئیدر"},{name:"رودان  ده بارز"},{name:"زمین سنگ"},{name:"زنگارد"},{name:"زیارت"},{name:"زیارتعلی"},{name:"ستلو"},{name:"سرچاهان"},{name:"سرخنگی"},{name:"سرخون"},{name:"سرزه"},{name:"سرگزاحمدی"},{name:"سندرک"},{name:"سهیلی"},{name:"سیاهو"},{name:"سیریک"},{name:"شمیل بندرعباس"},{name:"شمیل حاجی آباد"},{name:"شهاب سوزا"},{name:"شهرصنعتی  بندرعباس"},{name:"شهرک  مروارید"},{name:"شهرو"},{name:"صلخ"},{name:"طاشکویه"},{name:"طبل"},{name:"طولا"},{name:"عمانی"},{name:"فارسی اکبری"},{name:"فارغان"},{name:"فاریاب"},{name:"فاریاب سنگوئیه"},{name:"فاریاب کوهیج"},{name:"فتوئیه"},{name:"فین"},{name:"قشم"},{name:"قطب آباد"},{name:"قلات بالا"},{name:"قلعه قاضی"},{name:"قلعه کمیز"},{name:"کاروان  کوشه"},{name:"کچوئیه"},{name:"کرگان"},{name:"کریان"},{name:"کشاربالا"},{name:"کشارچمردان"},{name:"کشتی سازی  صدرا"},{name:"کشکو"},{name:"کمشک"},{name:"کناردان"},{name:"کنارسیاه"},{name:"کنارو"},{name:"کنچی"},{name:"کنخ"},{name:"کوخرد"},{name:"کوشک کنار"},{name:"کوه وای"},{name:"کوهستک"},{name:"کوهیج"},{name:"کهتوئیه"},{name:"کهورستان"},{name:"کیش"},{name:"گاوبندی"},{name:"گچین بالا"},{name:"گچین پائین"},{name:"گروک"},{name:"گزه"},{name:"گزیر"},{name:"گوران"},{name:"گوربند"},{name:"گورزانک"},{name:"گورین"},{name:"گهره"},{name:"گیاهدان"},{name:"لارک"},{name:"لافت"},{name:"لاوان"},{name:"لمزان"},{name:"مراغ"},{name:"مردنو"},{name:"مسن"},{name:"مغدان  بستک"},{name:"مغدان  گاوبندی"},{name:"مغویه"},{name:"میناب"},{name:"نخل ابراهیمی"},{name:"هاشم آباد"},{name:"هرنگ"},{name:"هشتبندی"},{name:"هشنیز"},{name:"هنگویه"}]
        },
        { name:  "همدان ۰۸۱", eng: "Hamadan 081",
          cities : [{name:"آب باریک"},{name:"آب مشکین"},{name:"آبدر"},{name:"آبرومند"},{name:"آبشینه"},{name:"آجین"},{name:"آرپادره"},{name:"آرتیمان"},{name:"آق تپه"},{name:"آقبلاغ  آق داق"},{name:"آقکند"},{name:"آورزمان"},{name:"ابرو"},{name:"احمدآباد"},{name:"احمدآباد شرا"},{name:"ارزانفود"},{name:"ازناوله"},{name:"ازندریان"},{name:"اسدآباد"},{name:"اسلام آباد"},{name:"اشتران"},{name:"اشترمل"},{name:"اصله"},{name:"اکنلو"},{name:"الفاوت"},{name:"امامزاده  پیرنهان"},{name:"امتلر"},{name:"امزاجرد"},{name:"امیرآباد رزن"},{name:"امیرآباد فامنین"},{name:"امیرآباد کبودرآهنگ"},{name:"انصارالامام"},{name:"انوچ"},{name:"اوچ تپه"},{name:"اورته قمیش"},{name:"اورقین"},{name:"اوریاد"},{name:"اوزن دره"},{name:"ایده لو"},{name:"ایوراع"},{name:"باباپیر"},{name:"باباخنجر"},{name:"بابارستم"},{name:"باباعلی"},{name:"باباقاسم"},{name:"باباکمال"},{name:"بابان"},{name:"بابانظر"},{name:"بادخوره"},{name:"برزول"},{name:"بشیک تپه"},{name:"بلرتو"},{name:"بوجان"},{name:"بوربور"},{name:"بهار"},{name:"بهکندان"},{name:"بیان"},{name:"بیغش"},{name:"بیوک آباد"},{name:"پادگان  قهرمان"},{name:"پایگاه  نوژه"},{name:"پرلوک"},{name:"پشتجین"},{name:"پهنه بر"},{name:"پیرملو"},{name:"پیروز"},{name:"پیهان"},{name:"تاوه سناج"},{name:"تپه دیبی"},{name:"تخت"},{name:"تفریجان"},{name:"توانه"},{name:"توچغاز"},{name:"توسک ملایر"},{name:"تویسرکان"},{name:"جامیشلو"},{name:"جرا"},{name:"جربانلو"},{name:"جعفریه"},{name:"جنت آباد"},{name:"جورقان"},{name:"جوزان"},{name:"جوکار"},{name:"جهان آباد"},{name:"جیجانکوه"},{name:"جیحون آباد"},{name:"چارلی"},{name:"چاشتخوره"},{name:"چایان"},{name:"چشین"},{name:"چنارسفلی"},{name:"چنارعلیا"},{name:"چوتاش"},{name:"چورمق"},{name:"چولک اصلی"},{name:"حاتم آباد"},{name:"حاجی آباد فامنین"},{name:"حبشی"},{name:"حسام آباد اسدآباد"},{name:"حسام آباد بهار"},{name:"حسن آباد امام"},{name:"حسن قشلاق"},{name:"حسین آباد آشوری"},{name:"حسین آباد شاملو"},{name:"حسین آباد گیان"},{name:"حسین آباد لتگاه"},{name:"حسین آباد ناظم"},{name:"حصارقره باغی"},{name:"حصارکوچه باغی"},{name:"حکان"},{name:"حیدره قاضی خانی"},{name:"خاکریز"},{name:"خان آباد"},{name:"خبرارخی"},{name:"خردمند"},{name:"خلیل کرد"},{name:"خنجرآباد"},{name:"خورونده"},{name:"خوشاب علیا"},{name:"خیرآباد"},{name:"دارانی"},{name:"داق داق آباد"},{name:"داویجان"},{name:"درجزین"},{name:"دستجرد"},{name:"دشته"},{name:"دمق"},{name:"ده پیاز"},{name:"ده شاکر"},{name:"ده موسی"},{name:"ده میانه"},{name:"دهفول"},{name:"دهلق"},{name:"دهلق ملایر"},{name:"دهنوآورزمان"},{name:"دهنوعبدالملکی"},{name:"دهنوعلی آباد"},{name:"دیزج"},{name:"دینارآباد"},{name:"رامیشان"},{name:"راه هموار"},{name:"راهجرد"},{name:"رباط شورین"},{name:"رحمان آباد"},{name:"رزن"},{name:"رزینی"},{name:"رسول آباد"},{name:"رضوان کده"},{name:"روان"},{name:"روعان"},{name:"زاغه"},{name:"زرامین سفلی"},{name:"زرقان"},{name:"زمان آباد"},{name:"زنگنه"},{name:"ساریجلو"},{name:"سامن"},{name:"سایان"},{name:"سراب"},{name:"سراوک"},{name:"سرایجوق"},{name:"سرخ آباد"},{name:"سردارآباد"},{name:"سرکان"},{name:"سفیدخانی"},{name:"سلطان آباد بهاره"},{name:"سلطان آباددمق"},{name:"سنقرآباد"},{name:"سنگستان"},{name:"سوباشی"},{name:"سوتلق"},{name:"سورتجین"},{name:"سوزن"},{name:"سولان"},{name:"سیدشهاب"},{name:"سیراب"},{name:"سیراوند"},{name:"سیمین زاغه"},{name:"شان آباد"},{name:"شاوه"},{name:"شاهنجرین"},{name:"شریف آباد"},{name:"شعبان"},{name:"شورین"},{name:"شوشاب"},{name:"شوند"},{name:"شهرستانه"},{name:"شهرک  بهار"},{name:"شهرک  صنعتی  بوعلی"},{name:"شهرک  نهاوند"},{name:"شهرک صنعتی  رزن"},{name:"شیرین سو"},{name:"صالح آباد"},{name:"طائمه"},{name:"طاسبندی"},{name:"طاسیران"},{name:"طاهرلو"},{name:"طجرسامن"},{name:"طجرعلوی"},{name:"طویلان سفلی"},{name:"عبدالرحیم"},{name:"عبدالمومن"},{name:"عسگرآباد"},{name:"عشاق"},{name:"علوی"},{name:"علی آباددمق"},{name:"علی صدر"},{name:"عین آباد"},{name:"فارسبان"},{name:"فارسجین"},{name:"فاماسب"},{name:"فامنین"},{name:"فرسفج"},{name:"فریازان"},{name:"فقیره"},{name:"فیازمان"},{name:"فیروزان"},{name:"فیض آباد"},{name:"قاباق تپه"},{name:"قادرخلج"},{name:"قایش"},{name:"قراکند"},{name:"قراگل"},{name:"قرخلر"},{name:"قروه درجزین"},{name:"قره بلاغ"},{name:"قزل آباد"},{name:"قزلجه حاجیلو"},{name:"قلعه جوق"},{name:"قلعه قباد"},{name:"قلعه نو"},{name:"قلقل رود"},{name:"قهاوند"},{name:"قهوردسفلی"},{name:"قهوردعلیا"},{name:"قینرجه"},{name:"کاج"},{name:"کارخانه"},{name:"کبودرآهنگ"},{name:"کرتیل آباد"},{name:"کردآباد"},{name:"کرزان"},{name:"کرفس"},{name:"کرک سفلی"},{name:"کرکان"},{name:"کریم آباد"},{name:"کسب"},{name:"کفراش"},{name:"کله سر"},{name:"کمازان"},{name:"کمری"},{name:"کمک سفلی"},{name:"کنجینه"},{name:"کندتپه"},{name:"کوریجان"},{name:"کوشک آباد"},{name:"کوه زره"},{name:"کوهانی"},{name:"کوهین"},{name:"کهارد"},{name:"کهریزبغازی"},{name:"کهریزسلیم"},{name:"کهکدان"},{name:"کهنوش"},{name:"گاوسوار"},{name:"گذرکجین"},{name:"گراچغا"},{name:"گرجایی"},{name:"گزل ابدال"},{name:"گشانی"},{name:"گل تپه"},{name:"گمین قلعه"},{name:"گنبد"},{name:"گنبدان بهار"},{name:"گنبدکبود"},{name:"گنج تپه"},{name:"گنده جین"},{name:"گونلو"},{name:"گیان"},{name:"گیل آباد"},{name:"لالجین"},{name:"لامیان"},{name:"لتگاه"},{name:"لکلک"},{name:"لولوهر"},{name:"مالک اشتر"},{name:"مالیچه"},{name:"ماه نیان"},{name:"مبارک آباد"},{name:"مسجدین"},{name:"ملابلاق"},{name:"ملایر"},{name:"ملوسان"},{name:"منگاوی"},{name:"موئیجین"},{name:"موسی آباد"},{name:"مهاجران"},{name:"مهدی آباد"},{name:"مهرآباد"},{name:"مهین آباد"},{name:"مهین آباد"},{name:"میانده"},{name:"میشن"},{name:"میلاب"},{name:"میلاجرد"},{name:"میهمله علیا"},{name:"نصرت آباد"},{name:"نصیرآباد"},{name:"نظام آباد"},{name:"نگارخاتون"},{name:"نمازگاه"},{name:"ننج"},{name:"نوآباد"},{name:"نوار"},{name:"نهاوند"},{name:"نیر"},{name:"واشان"},{name:"والاشجرد"},{name:"ورازنه"},{name:"وردآوردعلیا"},{name:"ورکانه"},{name:"وسج"},{name:"وصله"},{name:"وندرآباد"},{name:"وهمان"},{name:"وهنان"},{name:"ویان"},{name:"هارون آباد"},{name:"هریان"},{name:"هلور"},{name:"همدان"},{name:"همه کسی نهاوند"},{name:"همه کسی همدان"},{name:"هیزج"},{name:"یارمچه باغ"},{name:"یسرلو"},{name:"یکن آباد"},{name:"ینگی کند"},{name:"یوسف آباد"}]
        },
        { name:  "یزد ۰۳۵", eng: "Yazd 035",
          cities : [{name:"آریج"},{name:"آسفیج"},{name:"ابرکوه"},{name:"احمدآباد   اردکان"},{name:"احمدآباد   کریم آباد   سنجدک"},{name:"احمدآباد   مشیر"},{name:"اردکان"},{name:"اسدآباد"},{name:"اسفندآباد"},{name:"اسفندیار"},{name:"اسلامیه"},{name:"اشتیجه"},{name:"اشکذر"},{name:"اصفهک"},{name:"باجگان"},{name:"بافق"},{name:"بخ"},{name:"بخش بهمن   مهرآباد   توران پشت"},{name:"بداف"},{name:"بساب"},{name:"بنادک سادات"},{name:"بنادکوک دیزه"},{name:"بندرآباد"},{name:"بنستان"},{name:"بنیز"},{name:"بهاباد"},{name:"پیکوه  مرغوب"},{name:"ترکان  هرابرجان"},{name:"تفت"},{name:"تقویه"},{name:"تنگ چنار"},{name:"توتک"},{name:"توران پشت"},{name:"تیزورک"},{name:"جوخواه"},{name:"چاه افضل"},{name:"چاهک"},{name:"چاهوک  پندر"},{name:"حاجی آباد زرین"},{name:"حسن آباد"},{name:"حسین آباد ریسمانی"},{name:"حلوان"},{name:"خرانق"},{name:"خرم آباد"},{name:"خسروآباد"},{name:"خضرآباد"},{name:"خودسفلی"},{name:"خورمیز منشاد دره گل افشاد"},{name:"خوسف  بشگان"},{name:"خویدک"},{name:"دره زرشک"},{name:"ده بالا"},{name:"ده جمال"},{name:"ده عرب  صفی آباد"},{name:"ده کوشک"},{name:"ده محمد"},{name:"دهشیر"},{name:"دهنو"},{name:"دیهوک"},{name:"رباط پشت بادام"},{name:"رشکوئیه"},{name:"رضویه"},{name:"رکن آباد مهرآباد"},{name:"زارچ"},{name:"زردین"},{name:"زنوغان"},{name:"ساغند"},{name:"سانیج"},{name:"سخوید"},{name:"سروارنان"},{name:"سروسفلی"},{name:"سروسفلی"},{name:"سریزد"},{name:"سعیدآباد"},{name:"سلطانب"},{name:"سورک"},{name:"سیدمیرزا"},{name:"شحنه"},{name:"شرف آباد عزآباد"},{name:"شریف آباد"},{name:"شمس آباد"},{name:"شمسی"},{name:"شواز"},{name:"شهرآباد"},{name:"شهراسب"},{name:"شهرک صنعتی  مهریز"},{name:"شهرک صنعتی  میبد"},{name:"شهریاری"},{name:"شیطور دولت آباد"},{name:"صادق آباد"},{name:"صدرآباداردکان"},{name:"صدرآبادندوشن"},{name:"طبس"},{name:"طزرجان"},{name:"طزنج"},{name:"عبداله"},{name:"عرب آباد"},{name:"عشق آباد"},{name:"عقدا"},{name:"علی آباد تفت"},{name:"علی آباد چهل گزی"},{name:"علی آباد خیرآباد"},{name:"فتح آباد"},{name:"فخرآباد زرجوع"},{name:"فراغه"},{name:"فهالنج"},{name:"فهرج"},{name:"فیروزآباد"},{name:"فیض آباد صادق آباد"},{name:"کذاب  هامانه"},{name:"کرخنگان"},{name:"کردآباد"},{name:"کریت بالا"},{name:"کویجان"},{name:"کهدوئیه"},{name:"گردکوه"},{name:"گلویک"},{name:"مبارکه"},{name:"محمدآباد"},{name:"محمدآباد طبس"},{name:"مروست"},{name:"مریم آباد"},{name:"مزرعه حاج علی عسگر"},{name:"مزرعه حاجی عبداله"},{name:"مزرعه کلانتر حجت آباد محمدآباد"},{name:"مزرعه نو"},{name:"منشاد"},{name:"مهدی آباد بهادران"},{name:"مهریز"},{name:"میبد"},{name:"میرهاشم  بیدآخوید"},{name:"نایبند"},{name:"ندوشن"},{name:"نصرآباد"},{name:"نصرآباد"},{name:"نیر"},{name:"نیر"},{name:"هاشم آباد"},{name:"هرات"},{name:"هفتادر"},{name:"هفتهر"},{name:"همت آباد"},{name:"هنزا"},{name:"هودر"},{name:"یزد"}]
        }
    ];

    var countryCodes = [
      { name:"افغانستان ۰۰۹۳", eng: "Afghanistan 0093"},
      { name:"آلبانی ۰۰۳۵۵", eng: "Albania 00355"},
      { name:"الجزایر ۰۰۲۱۳", eng: "Algeria 00213"},
      { name:"ساموآ آمریکا ۰۰۱۶۸۴ ", eng: "American Samoa 001684"},
      { name:"آندورا ۰۰۳۷۶", eng: "Andorra 00376"},
      { name:"آنگولا ۰۰۲۴۴", eng: "Angola 00244"},
      { name:"آنگویلا  ۰۰۱۲۶۴", eng: "Anguilla 001264"},
      { name:"قطب جنوب ۰۰۶۷۲", eng: "Antarctica 00672"},
      { name:"آنتیگوا و باربودا ۰۰۱۲۶۸ ", eng: "Antigua and Barbuda 00168"},
      { name:"آرژانتین ۰۰۵۴", eng: "Argentina 0054"},
      { name:"ارمنستان ۰۰۳۷۴", eng: "Armenia 00374"},
      { name:"آروبا ۰۰۲۹۷", eng: "Aruba 00297"},
      { name:"استرالیا ۰۰۶۱", eng: "Australia 0061"},
      { name:"اتریش ۰۰۴۳", eng: "Austria 0043"},
      { name:"آذربایجان ۰۰۹۹۴", eng: "Azerbaijan 00994"},
      { name:"باهاما  ۰۰۱۲۴۲", eng: "Bahamas 001242"},
      { name:"بحرین ۰۰۹۷۳", eng: "Bahrain 00973"},
      { name:"بنگلادش ۰۰۸۸۰", eng: "Bangladesh 00880"},
      { name:"باربادوس  ۰۰۱۲۴۶", eng: "Barbados 001246"},
      { name:"بلاروس ۰۰۳۷۵", eng: "Belarus 00375"},
      { name:"بلژیک ۰۰۳۲", eng: "Belgium 0032"},
      { name:"بلیز ۰۰۵۰۱", eng: "Belize 00501"},
      { name:"بنین ۰۰۲۲۹", eng: "Benin 00229"},
      { name:"برمودا  ۰۰۱۴۴۱", eng: "Bermuda 001441"},
      { name:"بوتان ۰۰۹۷۵", eng: "Bhutan 00975"},
      { name:"بولیوی ۰۰۵۹۱", eng: "Bolivia 00591"},
      { name:"بوسنی و هرزگوین ۰۰۳۸۷", eng: "Bosnia and Herzegovina 00387"},
      { name:"بوتسوانا ۰۰۲۶۷", eng: "Botswana 00267"},
      { name:"برزیل ۰۰۵۵", eng: "Brazil 0055"},
      { name:"جزایر ویرجین بریتانیا  ۰۰۱۲۸۴", eng: "British Virgin Islands 001284"},
      { name:"برونئی ۰۰۶۷۳", eng: "Brunei 00673"},
      { name:"بلغارستان ۰۰۳۵۹", eng: "Bulgaria 00359"},
      { name:"بورکینافاسو ۰۰۲۲۶", eng: "Burkina Faso 00226"},
      { name:"میانمار ۰۰۹۵", eng: "Burma (Myanmar) 0095"},
      { name:"بروندی ۰۰۲۵۷", eng: "Burundi 00257"},
      { name:"کامبوج ۰۰۸۵۵", eng: "Cambodia 00855"},
      { name:"کامرون ۰۰۲۳۷", eng: "Cameroon 00237"},
      { name:"کانادا ۰۰۱", eng: "Canada 001"},
      { name:"کیپ ورد ۰۰۲۳۸", eng: "Cape Verde 00238"},
      { name:"جزایر کیمن  ۰۰۱۳۴۵", eng: "Cayman Islands 001345"},
      { name:"آفریقای مرکزی ۰۰۲۳۶", eng: "Central African Republic 00236"},
      { name:"چاد ۰۰۲۳۵", eng: "Chad 00235"},
      { name:"شیلی ۰۰۵۶", eng: "Chile 0056"},
      { name:"چین ۰۰۸۶", eng: "China 0086"},
      { name:"جزیره کریسمس ۰۰۶۱", eng: "Christmas Island 0061"},
      { name:"جزایر کوکوس ۰۰۶۱", eng: "Cocos (Keeling) Islands 0061"},
      { name:"۰۰۵۷ کلمبیا", eng: "Colombia 0057"},
      { name:"کومور ۰۰۲۶۹", eng: "Comoros 00269"},
      { name:"جزایر کوک ۰۰۶۸۲", eng: "Cook Islands 00682"},
      { name:"کاستاریکا ۰۰۵۰۶", eng: "Costa Rica 00506"},
      { name:"کرواسی ۰۰۳۸۵", eng: "Croatia 00385"},
      { name:"کوبا ۰۰۵۳", eng: "Cuba 0053"},
      { name:"قبرس ۰۰۳۵۷", eng: "Cyprus 00357"},
      { name:"جمهوری چک ۰۰۴۲۰", eng: "Czech Republic 00420"},
      { name:"کنگو ۰۰۲۴۳", eng: "Democratic Republic of the Congo 00243"},
      { name:"دانمارک ۰۰۴۵", eng: "Denmark 0045"},
      { name:"جیبوتی ۰۰۲۵۳", eng: "Djibouti 00253"},
      { name:"دومینیکا  ۰۰۱۷۶۷", eng: "Dominica 001767"},
      { name:"جمهوری دومینیکن  ۰۰۱۸۰۹", eng: "Dominican Republic 001809"},
      { name:"اکوادور ۰۰۵۹۳", eng: "Ecuador 00593"},
      { name:"مصر ۰۰۲۰", eng: "Egypt 0020"},
      { name:"ال سالوادور ۰۰۵۰۳", eng: "El Salvador 00503"},
      { name:"گینه استوایی ۰۰۲۴۰", eng: "Equatorial Guinea 00240"},
      { name:"اریتره ۰۰۲۹۱", eng: "Eritrea 00291"},
      { name:"استونی ۰۰۳۷۲", eng: "Estonia 00372"},
      { name:"اتیوپی ۰۰۲۵۱", eng: "Ethiopia 00251"},
      { name:"جزایر فالکلند ۰۰۵۰۰", eng: "Falkland Islands 00500"},
      { name:"جزایر فارو ۰۰۲۹۸", eng: "Faroe Islands 00298"},
      { name:"فیجی ۰۰۶۷۹", eng: "Fiji 00679"},
      { name:"فنلاند ۰۰۳۵۸", eng: "Finland 00358"},
      { name:"فرانسه ۰۰۳۳", eng: "France 0033"},
      { name:"پلینزی فرانسه ۰۰۶۸۹", eng: "French Polynesia 00689"},
      { name:"گابن ۰۰۲۴۱", eng: "Gabon 00241"},
      { name:"گامبیا ۰۰۲۲۰", eng: "Gambia 00220"},
      { name:"نوار غزه ۰۰۹۷۰", eng: "Gaza Strip 00970"},
      { name:"گرجستان ۰۰۹۹۵", eng: "Georgia 00995"},
      { name:"آلمان ۰۰۴۹", eng: "Germany 0049"},
      { name:"غنا ۰۰۲۳۳", eng: "Ghana 00233"},
      { name:"جبل الطارق ۰۰۳۵۰", eng: "Gibraltar 00350"},
      { name:"یونان ۰۰۳۰", eng: "Greece 0030"},
      { name:"گرینلند ۰۰۲۹۹", eng: "Greenland 00299"},
      { name:"گرانادا  ۰۰۱۴۷۳", eng: "Grenada 001473"},
      { name:"گوام  ۰۰۱۶۷۱", eng: "Guam 001671"},
      { name:"گواتمالا ۰۰۵۰۲", eng: "Guatemala 00502"},
      { name:"گینه ۰۰۲۲۴", eng: "Guinea 00224"},
      { name:"گینه بیسائو ۰۰۲۴۵", eng: "Guinea-Bissau 00245"},
      { name:"گویان ۰۰۵۹۲", eng: "Guyana 00592"},
      { name:"هائیتی ۰۰۵۰۹", eng: "Haiti 00509"},
      { name:"واتیکان ۰۰۳۹", eng: "Holy See (Vatican City) 0039"},
      { name:"هندوراس ۰۰۵۰۴", eng: "Honduras 00504"},
      { name:"هنگ کنگ ۰۰۸۵۲", eng: "Hong Kong 00852"},
      { name:"مجارستان ۰۰۳۶", eng: "Hungary 0036"},
      { name:"ایسلند ۰۰۳۵۴", eng: "Iceland 00354"},
      { name:"هند ۰۰۹۱", eng: "India 0091"},
      { name:"اندونزی ۰۰۶۲", eng: "Indonesia 0062"},
      { name:"ایران ۰۰۹۸", eng: "Iran 0098"},
      { name:"عراق ۰۰۹۶۴", eng: "Iraq 00964"},
      { name:"ایرلند ۰۰۳۵۳", eng: "Ireland 00353"},
      { name:"جزیره من ۰۰۴۴", eng: "Isle of Man 0044"},
      { name:"اسرائیل ۰۰۹۷۲", eng: "Israel 00972"},
      { name:"ایتالیا ۰۰۳۹", eng: "Italy 0039"},
      { name:"ساحل عاج ۰۰۲۲۵", eng: "Ivory Coast 00225"},
      { name:"جاماییکا  ۰۰۱۸۷۶", eng: "Jamaica 001876"},
      { name:"ژاپن ۰۰۸۱", eng: "Japan 0081"},
      { name:"اردن ۰۰۹۶۲", eng: "Jordan 00962"},
      { name:"قزاقستان ۰۰۷", eng: "Kazakhstan 007"},
      { name:"کنیا ۰۰۲۵۴", eng: "Kenya 00254"},
      { name:"کریباتی ۰۰۶۸۶", eng: "Kiribati 00686"},
      { name:"کوزوو ۰۰۳۸۱", eng: "Kosovo 00381"},
      { name:"کویت ۰۰۹۶۵", eng: "Kuwait 00965"},
      { name:"قرقیزستان ۰۰۹۹۶", eng: "Kyrgyzstan 00996"},
      { name:"لائوس ۰۰۸۵۶", eng: "Laos 00856"},
      { name:"لتونی ۰۰۳۷۱", eng: "Latvia 00371"},
      { name:"لبنان ۰۰۹۶۱", eng: "Lebanon 00961"},
      { name:"لسوتو ۰۰۲۶۶", eng: "Lesotho 00266"},
      { name:"لیبریا ۰۰۲۳۱", eng: "Liberia 00231"},
      { name:"لیبی ۰۰۲۱۸", eng: "Libya 00218"},
      { name:"لیختنشتاین ۰۰۴۲۳", eng: "Liechtenstein 00423"},
      { name:"لیتوانی ۰۰۳۷۰", eng: "Lithuania 00370"},
      { name:"لوگزامبورگ ۰۰۳۵۲", eng: "Luxembourg 00352"},
      { name:"ماکلائو ۰۰۸۵۳", eng: "Macau 00853"},
      { name:"مقدونیه ۰۰۳۸۹", eng: "Macedonia 00389"},
      { name:"ماداگاسکار ۰۰۲۶۱", eng: "Madagascar 00261"},
      { name:"مالایو ۰۰۲۶۵", eng: "Malawi 00265"},
      { name:"مالزی ۰۰۶۰", eng: "Malaysia 0060"},
      { name:"مالدیو ۰۰۹۶۰", eng: "Maldives 00960"},
      { name:"مالی ۰۰۲۲۳", eng: "Mali 00223"},
      { name:"مالت ۰۰۳۵۶", eng: "Malta 00356"},
      { name:"جزایر مارشال ۰۰۶۹۲", eng: "Marshall Islands 00692"},
      { name:"موریتانی ۰۰۲۲۲", eng: "Mauritania 00222"},
      { name:"موریس ۰۰۲۳۰", eng: "Mauritius 00230"},
      { name:"مایوت ۰۰۲۶۲", eng: "Mayotte 00262"},
      { name:"مکزیک ۰۰۵۲", eng: "Mexico 0052"},
      { name:"میکرونزی ۰۰۶۹۱", eng: "Micronesia 00691"},
      { name:"مولداوی ۰۰۳۷۳", eng: "Moldova 00373"},
      { name:"موناکو ۰۰۳۷۷", eng: "Monaco 00377"},
      { name:"مغولستان ۰۰۹۷۶", eng: "Mongolia 00976"},
      { name:"مونتنگرو ۰۰۳۸۲", eng: "Montenegro 00382"},
      { name:"مونتسرات  ۰۰۱۶۶۴", eng: "Montserrat 001664"},
      { name:"مراکش ۰۰۲۱۲", eng: "Morocco 00212"},
      { name:"موزامبیک ۰۰۲۵۸", eng: "Mozambique 00258"},
      { name:"نامیبیا ۰۰۲۶۴", eng: "Namibia 00264"},
      { name:"نائورو ۰۰۶۷۴", eng: "Nauru 00674"},
      { name:"نپال ۰۰۹۷۷", eng: "Nepal 00977"},
      { name:"هلند ۰۰۳۱", eng: "Netherlands 0031"},
      { name:"آنتیل هلند ۰۰۵۹۹", eng: "Netherlands Antilles 00599"},
      { name:"کالدونیای جدید ۰۰۶۸۷", eng: "New Caledonia 00687"},
      { name:"نیوزلند ۰۰۶۴", eng: "New Zealand 0064"},
      { name:"نیکاراگوئه ۰۰۵۰۵", eng: "Nicaragua 00505"},
      { name:"نیجر ۰۰۲۲۷", eng: "Niger 00227"},
      { name:"نیجریه ۰۰۲۳۴", eng: "Nigeria 00234"},
      { name:"نیوئه ۰۰۶۸۳", eng: "Niue 00683"},
      { name:"جزیره نورفولک ۰۰۶۷۲", eng: "Norfolk Island 00672"},
      { name:"کره شمالی ۰۰۸۵۰", eng: "North Korea 00850"},
      { name:"جزایر ماریانای شمالی  ۰۰۱۶۷۰", eng: "Northern Mariana Islands 001670"},
      { name:"نروژ ۰۰۴۷", eng: "Norway 0047"},
      { name:"عمان ۰۰۹۶۸", eng: "Oman 00968"},
      { name:"پاکستان ۰۰۹۲", eng: "Pakistan 0092"},
      { name:"پالائو ۰۰۶۸۰", eng: "Palau 00680"},
      { name:"پاناما ۰۰۵۰۷", eng: "Panama 00507"},
      { name:"پاپوآ گینه نو ۰۰۶۷۵", eng: "Papua New Guinea 00675"},
      { name:"پاراگوئه ۰۰۵۹۵", eng: "Paraguay 00595"},
      { name:"پرو ۰۰۵۱", eng: "Peru 0051"},
      { name:"فیلیپین ۰۰۶۳", eng: "Philippines 0063"},
      { name:"جزایر پیت کرن ۰۰۸۷۰", eng: "Pitcairn Islands 00870"},
      { name:"لهستان ۰۰۴۸", eng: "Poland 0048"},
      { name:"پرتقال ۰۰۳۵۱", eng: "Portugal 00351"},
      { name:"پورتوریکو ۰۰۱", eng: "Puerto Rico 001"},
      { name:"قطر ۰۰۹۷۴", eng: "Qatar 00974"},
      { name:"جمهوری کنگو ۰۰۲۴۲", eng: "Republic of the Congo 00242"},
      { name:"رومانی ۰۰۴۰", eng: "Romania 0040"},
      { name:"روسیه ۰۰۷", eng: "Russia 007"},
      { name:"رواندا ۰۰۲۵۰", eng: "Rwanda 00250"},
      { name:"سنت بارتلمی ۰۰۵۹۰", eng: "Saint Barthelemy 00590"},
      { name:"سنت هلن ۰۰۲۹۰", eng: "Saint Helena 00290"},
      { name:"سنت کیتس و نویس  ۰۰۱۸۶۹", eng: "Saint Kitts and Nevis 001869"},
      { name:"سنت لوسیا  ۰۰۱۷۵۸", eng: "Saint Lucia 0Saint Martin 01758"},
      { name:"سنت مارتین  ۰۰۱۵۹۹", eng: " 001599"},
      { name:"سنت پیر و میکلون ۰۰۵۰۸", eng: "Saint Pierre and Miquelon 00508"},
      { name:"سنت وینسنت و گرنادین ۰۰۱ ۷۸۴", eng: "Saint Vincent and the Grenadines 001 784"},
      { name:"ساموآ ۰۰۶۸۵", eng: "Samoa 00685"},
      { name:"سن مارین ۰۰۳۷۸", eng: "San Marino 00378"},
      { name:"سائوتومه و پرنسیپ ۰۰۲۳۹", eng: "Sao Tome and Principe 00239"},
      { name:"عربستان ۰۰۹۶۶", eng: "Saudi Arabia 00966"},
      { name:"سنگال ۰۰۲۲۱", eng: "Senegal 00221"},
      { name:"صربستان ۰۰۳۸۱", eng: "Serbia 00381"},
      { name:"سیشل ۰۰۲۴۸", eng: "Seychelles 00248"},
      { name:"سیرالئون ۰۰۲۳۲", eng: "Sierra Leone 00232"},
      { name:"سنگاپور ۰۰۶۵", eng: "Singapore 0065"},
      { name:"اسلواکی ۰۰۴۲۱", eng: "Slovakia 00421"},
      { name:"اسلونی ۰۰۳۸۶", eng: "Slovenia 00386"},
      { name:"جزایر سلیمان ۰۰۶۷۷", eng: "Solomon Islands 00677"},
      { name:"سومالی ۰۰۲۵۲", eng: "Somalia 00252"},
      { name:"آفریقای جنوبی ۰۰۲۷", eng: "South Africa 0027"},
      { name:"کره جنوبی ۰۰۸۲", eng: "South Korea 0082"},
      { name:"اسپانیا ۰۰۳۴", eng: "Spain 0034"},
      { name:"سریلانکا ۰۰۹۴", eng: "Sri Lanka 0094"},
      { name:"سودان ۰۰۲۴۹", eng: "Sudan 00249"},
      { name:"سورینام ۰۰۵۹۷", eng: "Suriname 00597"},
      { name:"سوازیلند ۰۰۲۶۸", eng: "Swaziland 00268"},
      { name:"سوئد ۰۰۴۶", eng: "Sweden 0046"},
      { name:"سویس ۰۰۴۱", eng: "Switzerland 0041"},
      { name:"سوریه ۰۰۹۶۳", eng: "Syria 00963"},
      { name:"تایوان ۰۰۸۸۶", eng: "Taiwan 00886"},
      { name:"تاجیکستان ۰۰۹۹۲", eng: "Tajikistan 00992"},
      { name:"تانزانیا ۰۰۲۵۵", eng: "Tanzania 00255"},
      { name:"تایلند ۰۰۶۶", eng: "Thailand 0066"},
      { name:"تیمور شرق ۰۰۶۷۰", eng: "Timor-Leste 00670"},
      { name:"توگو ۰۰۲۲۸", eng: "Togo 00228"},
      { name:"توکلائو ۰۰۶۹۰", eng: "Tokelau 00690"},
      { name:"تونگا ۰۰۶۷۶", eng: "Tonga 00676"},
      { name:"ترینیداد و توباگو  ۰۰۱۸۶۸", eng: "Trinidad and Tobago 001868"},
      { name:"تونس ۰۰۲۱۶", eng: "Tunisia 00216"},
      { name:"ترکیه ۰۰۹۰", eng: "Turkey 0090"},
      { name:"ترکمنستان ۰۰۹۹۳", eng: "Turkmenistan 00993"},
      { name:"جزایر ترکس و کیاکوس  ۰۰۱۶۴۹", eng: "Turks and Caicos Islands 001649"},
      { name:"تووالو ۰۰۶۸۸", eng: "Tuvalu 00688"},
      { name:"اوگاندا ۰۰۲۵۶", eng: "Uganda 00256"},
      { name:"اوکراین ۰۰۳۸۰", eng: "Ukraine 00380"},
      { name:"امارات متحده عربی ۰۰۹۷۱", eng: "United Arab Emirates 00971", slang:"dubai, دوبی, دبی"},
      { name:"انگلستان ۰۰۴۴", eng: "United Kingdom 0044", slang:"uk, انگلیس"},
      { name:"ایالات متحده آمریکا ۰۰۱", eng: "United States 001" , slang:"us , usa, امریکا"},
      { name:"اروگوئه ۰۰۵۹۸", eng: "Uruguay 00598"},
      { name:"جزایر ویرجین ایالات متحده  ۰۰۱۳۴۰", eng: "US Virgin Islands 001340"},
      { name:"ازبکستان ۰۰۹۹۸", eng: "Uzbekistan 00998"},
      { name:"وانواتو ۰۰۶۷۸", eng: "Vanuatu 00678"},
      { name:"ونزوئلا ۰۰۵۸", eng: "Venezuela 0058"},
      { name:"ویتنام ۰۰۸۴", eng: "Vietnam 0084"},
      { name:"والیس و فوتونا ۰۰۶۸۱", eng: "Wallis and Futuna 00681"},
      { name:"بانک غرب ۰۰۹۷۰", eng: "West Bank 00970"},
      { name:"یمن ۰۰۹۶۷", eng: "Yemen 00967"},
      { name:"زامبیا ۰۰۲۶۰", eng: "Zambia 00260"},
      { name:"زیمباوه ۰۰۲۶۳", eng: "Zimbabwe 00263"}
    ];

    var mobileCodes = [
      {name: "۰۹۱۱ همراه اول استان گلستان، گیلان، مازندران", eng: "0911"},
      {name: "۰۹۱۲ همراه اول استان تهران، البرز، زنجان، سمنان، قزوین، قم", eng: "0912"},
      {name: "۰۹۱۳ همراه اول استان اصفهان، کرمان، یزد، چهارمحال و بختیاری", eng: "0913"},
      {name: "۰۹۱۴ همراه اول استان آذربایجان شرقی، غربی، اردبیل", eng: "0914"},
      {name: "۰۹۱۵ همراه اول استان خراسان شمالی، رضوی، جنوبی، سیستان و بلوچستان", eng: "0915"},
      {name: "۰۹۱۶ همراه اول استان خوزستان، لرستان", eng: "0916"},
      {name: "۰۹۱۷ همراه اول استان فارس، کهگیلویه و بویر احمد، هرمزگان، بوشهر", eng: "0917"},
      {name: "۰۹۱۸ همراه اول استان همدان، ایلام، مرکزی، کردستان، کرمانشاه", eng: "0918"},
      {name: "تالیا ۰۹۳۲", eng: "Taliya 0932"},
      {name: "۰۹۳۱ اسپادان", eng: "Spadan 0931"},
      {name: "۰۹۳۴ شبکه مستقل تلفن همراه کیش", eng: "TKC 0934"},
      {name: "۰۹۱۰ ، ۰۹۱۹ اپراتور اول ، همراه اول", eng: "0910 0919 MCI"},
      {name: "۰۹۰۱ ، ۰۹۰۲ ، ۰۹۳۰ ، ۰۹۳۳ ، ۰۹۳۵ ، ۰۹۳۶ ، ۰۹۳۷ ، ۰۹۳۸ ، ۰۹۳۹ ایرانسل", eng: "Irancell 0901 0902 0930 0933 0935 0936 0937 0938 0939"},
      {name: "۰۹۲۰ ، ۰۹۲۱ رایتل ، تامین تلکام", eng: "0920, 0921 Rightel"}
   ];

   var plates = [
        { name:  "آذربایجان شرقی ۱۵،۲۵،۳۵", eng: "Azerbaijan East 15,25,35"},
        { name:  "آذربایجان غربی ۱۷،۲۷،۳۷", eng: "Azerbaijan West 17,27,37"},
        { name:  "اردبیل ۹۱", eng: "Ardabil 91"},
        { name:  "اصفهان ۱۳،۲۳،۴۳،۵۳", eng: "Isfahan 13,23,43,53"},
        { name:  "البرز ۶۸", eng: "Alborz 68"},
        { name:  "ایلام ۹۸", eng: "Ilam 98"},
        { name:  "بوشهر ۴۸،۵۸", eng: "Bushehr 48,58"},
        { name:  "تهران ۱۱،۲۲،۳۳،۴۴،۵۵،۶۶،۷۷،۸۸،۹۹،۱۰،۲۰،۳۰،۴۰،۵۰،۶۰،۷۰،۸۰،۹۰", eng: "Tehran 11,22,33,44,55,66,77,88,99,10,20,30,40,50,60,70,80,90"},
	{ name:  "توابع استان تهران ۲۱,۷۸", eng: "Counties of Tehran 78,21"},
	{ name:  "چهارمحال و بختیاری ۷۱،۸۱", eng: "Chahar-Mahaal-Bakhtiari 71,81"},
        { name:  "خراسان جنوبی ۱۲،۳۲،۴۲،۵۲", eng: "Khorasan 12,32,42,52"},
        { name:  "خوزستان ۱۴،۲۴،۳۴", eng: "Khuzestan 14,24,34"},
        { name:  "زنجان ۸۷،۹۷", eng: "Zanjan 87,97"},
        { name:  "سمنان ۸۶،۹۶", eng: "Semnan 86,96"},
        { name:  "سیستان و بلوچستان ۸۵،۹۵", eng: "Sistan-Baluchestan 85,95"},
        { name:  "فارس ۶۳،۷۳،۸۳،۹۳", eng: "Fars 63,73,83,93"},
        { name:  "قزوین ۷۹،۸۹", eng: "Qazvin 79,89"},
        { name:  "قم ۱۶،۲۶،۳۶", eng: "Qom 16,26,36"},
        { name:  "کردستان ۵۱،۶۱", eng: "Kurdistan 51,61"},
        { name:  "کرمان ۴۵،۶۵،۷۵", eng: "Kerman 45,65,75"},
        { name:  "کرمانشاه ۱۹،۲۹،۳۹", eng: "Kermanshah 19,29,39"},
        { name:  "کهگیلویه و بویراحمد ۴۹", eng: "Kohgiluyeh-Boyer-Ahmad 49"},
        { name:  "گلستان ۵۹،۶۹", eng: "Golestan 59,69"},
        { name:  "گیلان ۴۶،۵۶،۷۶", eng: "Gilan 46,56,76"},
        { name:  "لرستان ۳۱،۴۱", eng: "Lorestan 31,41"},
        { name:  "مازندران ۶۲،۷۲،۸۲،۹۲", eng: "Mazandaran 62,72,82,92"},
        { name:  "مرکزی ۴۷،۵۷،۶۷", eng: "Markazi 47,57,67"},
        { name:  "هرمزگان ۸۴،۹۴", eng: "Hormozgan 84,94"},
        { name:  "همدان ۱۸،۲۸،۳۸", eng: "Hamadan 18,28,38"},
        { name:  "یزد ۵۴،۶۴،۷۴", eng: "Yazd 54,64,74"}
    ];


    var tehranCodes = [
        { name: "مرکز مخابرات جماران ۲۰۱۰ ۲۲۲۸ ۲۲۲۹ ۲۲۸۰ ۲۲۸۱ ۲۲۸۲ ۲۲۸۳ ۲۶۱۲ ۲۶۱۳", eng: "2010 2228 2229 2280 2281 2282 2283 2612 2613",
            areas : [{name:"رحمان آباد"},{name:"جمال آباد"},{name:"منظریه"},{name:"حصارک"},{name:"جماران"},{name:"کاشانک"},{name:"نیاوران"},{name:"اقدسیه"},{name:"صاحبقرانیه"},{name:"کامرانیه"},{name:"لارک"},{name:"آجوادنیه"},{name:"سامیان شهرک طالقانی"},{name:"فرمانیه"},{name:"شهرک شهید چمران"},{name:"پاسداران"},{name:"اخیاریه شمالی"},{name:"نوبنیاد"}]
        },
        { name: "مرکز مخابرات باهنر  ۲۲۶۴ ۲۲۶۳ ۲۲۶۲ ۲۲۶۱ ۲۲۶۰ ۲۲۰۰", eng: "2264 2263 2262 2261 2260 2200",
            areas : [{name:"الهیه"},{name:"زرگنده"},{name:"قلهک"},{name:"حسن‌آباد"},{name:"بلوار کاوه"},{name:"کلاهدوز"},{name:"دولت"},{name:"شریعتی"}]
        },
        { name: "مرکز مخابرات استقلال ۲۶۲۱ ۲۶۲۰ ۲۲۶۶ ۲۲۶۵ ۲۲۰۵ ۲۲۰۴ ۲۲۰۳ ۲۲۰۲ ۲۲۰۱", eng: "2621 2620 2266 2265 2205 2204 2203 2202 2201",
            areas : [{name:"محمودیه"},{name:"امانیه"},{name:"نمایشگاه"},{name:"آفریقا"},{name:"جردن"},{name:"ولیعصر"}]
        },
        { name: "مرکز مخابرات سلمان فارسی ۲۲۳۷ ۲۲۳۶ ۲۲۳۵ ۲۲۳۴ ۲۲۱۴ ۲۲۱۳ ۲۲۱۲ ۲۲۱۱ ۲۲۰۹ ۲۲۰۸ ۲۲۰۷ ۲۲۰۶", eng: "2237 2236 2235 2234 2214 2213 2212 2211 2209 2208 2207 2206",
            areas : [{name:"سعادت آباد"},{name:"کوی فراز"},{name:"شهرک خودروسازان"},{name:"شهرک مخابرات"},{name:"شهرک تامین اجتماعی"},{name:"شهرک پرواز"},{name:"شهرک شریف‌آباد"},{name:"اسلام آباد"}]
        },
        { name: "مرکز مخابرات شهید مفتح ۲۲۸۹ ۲۲۸۸ ۲۲۸۷ ۲۲۸۶ ۲۲۸۵ ۲۲۸۴ ۲۲۱۰", eng: "2289 2288 2287 2286 2285 2284 2210",
            areas : [{name:"سید خندان"},{name:"ضرابخانه"},{name:"چالهرز"},{name:"پاسداران"},{name:"خواجه عبدالله"},{name:"جلفا"}]
        },
        { name: "مرکز مخابرات شهید قدوسی ۲۲۹۲ ۲۲۹۱ ۲۲۹۰ ۲۲۲۷ ۲۲۲۶ ۲۲۲۵ ۲۲۲۲ ۲۲۱۵", eng: "2292 2291 2290 2227 2226 2225 2215",
            areas : [{name:"ظفر"},{name:"میرداماد"},{name:"داودیه"}]
        },
        { name: "مرکز مخابرات جعفری ۲۲۴۳ ۲۲۴۲ ۲۲۴۱ ۲۲۴۰ ۲۲۱۸ ۲۲۱۷", eng: "2243 2242 2241 2240 2218 2217",
            areas : [{name:"ولنجک"},{name:"زعفرانیه"},{name:"اوین"},{name:"شهرک کارمندان دولت"},{name:"درکه"},{name:"بلوار دانشجو"}]
        },
        { name: "مرکز مخابرات محلاتی ۲۲۴۹ ۲۲۴۸ ۲۲۴۷ ۲۲۴۶ ۲۲۴۵ ۲۲۴۴ ۲۲۱۹", eng: "2249 2248 2247 2246 2244 2219",
            areas : [{name:"ازگل"},{name:"حدادیه"},{name:"احتسابیه"},{name:"باغ لش کرد"},{name:"سوهانک"},{name:"شهرک نفت"},{name:"شهرک البرز"},{name:"شهرک قائم"},{name:"شهرک محلاتی"},{name:"شهرک گل‌ها"},{name:"شهرک دانشگاه"},{name:"شهرک ابوذر"},{name:"شهرک ولیعصر"},{name:"بلوار اوشان"},{name:"مینی سیتی"}]
        },
        { name: "مرکز مخابرات غریبی ۲۲۶۹ ۲۲۶۸ ۲۲۶۷ ۲۲۲۴ ۲۲۲۳ ۲۲۲۱ ۲۲۲۰", eng: "2269 2268 2267 2224 2223 2221 2220",
            areas : [{name:"قیطریه"},{name:"چیذر"},{name:"پل رومی"},{name:"بلوار کاوه"},{name:"شریعتی"}]
        },
        { name: "مرکز مخابرات تندگویان ۲۶۳۰ ۲۲۵۳ ۲۲۵۲ ۲۲۵۱ ۲۲۵۰ ۲۲۳۳ ۲۲۳۲ ۲۲۳۱ ۲۲۳۰ ۲۶۳۱", eng: "2630 2253 2252 2251 2250 2233 2232 2231 2230 2631",
            areas : [{name:"شمس آباد"},{name:"مجیدیه"},{name:"کاظم آباد"},{name:"ریحانی"},{name:"بنی‌هاشم"}]
        },
        { name: "مرکز مخابرات پاسداران ۲۲۸۷ ۲۲۷۷ ۲۲۷۶ ۲۲۵۹ ۲۲۵۸ ۲۲۵۷ ۲۲۵۶ ۲۲۵۵ ۲۲۵۴", eng: "2278 2277 2276 2259 2258 2257 2256 2255 2254",
            areas : [{name:"پاسداران"},{name:"اختیاریه"},{name:"گلستان"},{name:"احتشامیه"},{name:"دروس"},{name:"کلاهدوز"},{name:"دولت"},{name:"دیباجی جنوبی"}]
        },
        { name: "مرکز مخابرات دستغیب ۲۲۷۵ ۲۲۷۴ ۲۲۷۳ ۲۲۷۲ ۲۲۷۱ ۲۲۷۰", eng: "2275 2274 2273 2272 2271 2270",
            areas : [{name:"تجریش"},{name:"دزاشیب"},{name:"امامزاده قاسم"},{name:"سعد آباد"},{name:"جعفر آباد"},{name:"دربند"}]
        },
        { name: "مرکز مخابرات شهید لطیفی ۲۲۹۸ ۲۲۹۷ ۲۲۹۶ ۲۲۹۵ ۲۲۹۴ ۲۲۹۳", eng: "2298 2297 2296 2295 2294 2293",
            areas : [{name:"لویزان"},{name:"شیان"},{name:"شهرک لویزان"},{name:"شهرک ولیعصر"},{name:"حسین آباد"},{name:"مبارک آباد"},{name:"هروی"},{name:"کوی نوبنیاد"},{name:"ده نارمک"}]
        },
        { name: "مرکز مخابرات الغدیر ۳۳۷۳ ۳۳۷۲ ۳۳۷۱ ۳۳۷۰ ۳۳۶۹ ۳۳۶۸ ۳۳۴۳ ۳۳۰۴ ۳۳۰۳ ۳۳۰۲ ۳۳۰۱ ۳۳۰۰", eng: "3373 3372 3371 3370 3369 3368 3343 3304 3303 3302 3301 3300",
            areas : [{name:"هاشم آباد"},{name:"دولاب"},{name:"مجتمع مسکونی گل‌ها"}]
        },
        { name: "مرکز مخابرات اشرفی اصفهانی ۳۳۱۹ ۳۳۱۸ ۳۳۱۷ ۳۳۱۶ ۳۳۱۰ ۳۳۰۸ ۳۳۰۷ ۳۳۰۶ ۳۳۰۵", eng: "3319 3318 3317 3316 3310 3308 3307 3306 3305",
            areas : [{name:"فرح آباد"},{name:"اصفهانک"},{name:"سلیمانیه"},{name:"قصر فیروزه"},{name:"بسیج"}]
        },
        { name: "مرکز مخابرات ملت ۳۳۹۸ ۳۳۹۷ ۳۳۹۶ ۳۳۹۵ ۳۳۹۴ ۳۳۹۳ ۳۳۹۲ ۳۳۹۱ ۳۳۹۰ ۳۳۶۷ ۳۳۲۹ ۳۳۲۷ ۳۳۱۱ ۳۳۹۹", eng: "3398 3397 3396 3395 3394 3393 3392 3391 3390 3367 3329 3327 3311 3399",
            areas : [{name:"پامنار"},{name:"بهارستان"},{name:"سعدی"},{name:"جمهوری"},{name:"لاله‌زار"},{name:"ناصر خسرو"}]
        },
        { name: "مرکز مخابرات دیالمه ۳۳۵۶ ۳۳۵۵ ۳۳۵۴ ۳۳۵۲ ۳۳۵۱ ۳۳۵۰ ۳۳۴۴ ۳۳۱۳ ۳۳۱۲", eng: "3356 3355 3354 3352 3351 3350 3344 3313 3312",
            areas : [{name:"۱۵ خرداد"},{name:"مولوی"},{name:"۱۷ شهریور"}]
        },
        { name: "مرکز مخابرات هجرت ۳۳۱۴ ۳۳۱۵ ۳۳۶۴ ۳۳۶۵ ۳۳۶۶ ۳۳۸۰ ۳۳۸۱ ۳۳۸۲ ۳۳۸۳ ۳۳۸۴", eng: "3314 3315 3364 3365 3380 3381 3382 3383 3384",
            areas : [{name:"افسریه"},{name:"شهرک ابوذر"},{name:"شهرک والفجر"},{name:"مسعودیه"},{name:"اسلام آباد"},{name:"قصر فیروزه"}]
        },
        { name: "مرکز مخابراتی شهید باکری ۳۳۲۴ ۳۳۲۳ ۳۳۲۲ ۳۳۲۱ ۳۳۲۰", eng: "3320 3321 3322 3323 3324",
            areas : [{name:"سه راه تختی"},{name:"اتوبان افسریه"},{name:"بسیج"}]
        },
        { name: "مرکز مخابرات خاورشهر ۳۳۸۵ ۳۳۲۶", eng: "3385 3326",
            areas : [{name:"جاده خاوران و حومه"}]
        },
        { name: "مرکز مخابرات صنعتی خاوران ۳۳۲۸", eng: "3328",
            areas : [{name:"شهرک صنعتی خاوران"},{name:"جاده خاوران"},{name:"حومه پاکدشت"}]
        },
        { name: "مرکز مخابرات پیروزی ۳۳۷۹ ۳۳۷۸ ۳۳۳۶ ۳۳۳۵ ۳۳۳۴ ۳۳۳۳ ۳۳۳۲ ۳۳۳۱ ۳۳۳۰", eng: "3379 3378 3336 3335 3334 3333 3332 3331 3330",
            areas : [{name:"پیروزی"},{name:"صد دستگاه"},{name:"چهارصد دستگاه"}]
        },
        { name: "مرکز مخابرات عرب سرخی ۳۳۷۷ ۳۳۷۶ ۳۳۷۵ ۳۳۷۴ ۳۳۶۳ ۳۳۳۹ ۳۳۳۸ ۳۳۳۷", eng: "3377 3376 3375 3374 3363 3339 3338 3337",
            areas : [{name:"قلعه دولت آباد"},{name:"مالک آباد"},{name:"شهرک امام خمینی"},{name:"زورآباد"},{name:"منصورآباد"},{name:"جوانمرد"},{name:"چشمه علی"},{name:"شهرک انقلاب"},{name:"ابن بابویه"},{name:"دیلمان"}]
        },
        { name: "مرکز مخابرات نبوی ۳۳۵۳ ۳۳۴۲ ۳۳۴۱ ۳۳۴۰", eng: "3340 3341 3342 3353",
            areas : [{name:"امین‌آباد"},{name:"تقی‌آباد"},{name:"شهرک مفتح"},{name:"عباس‌آباد"},{name:"اسلام‌آباد"}]
        },
        { name: "مرکز مخابرات مشهدی مهدی ۳۳۸۷ ۳۳۸۶ ۳۳۵۷ ۳۳۴۹ ۳۳۴۸ ۳۳۴۷ ۳۳۴۶ ۳۳۴۵", eng: "3387 3386 3357 3349 3348 3347 3346",
            areas : [{name:"مسگریه"},{name:"مسعودیه"},{name:"مشیریه"},{name:"رضویه"}]
        },
        { name: "مرکز مخابرات قیام دشت ۳۳۵۹ ۳۳۵۸", eng: "3359 3358",
            areas : [{name:"پاک‌دشت ورامین و حومه"}]
        },
        { name: "مرکز مخابرات درزی ۳۳۸۹ ۳۳۸۸ ۳۳۶۲ ۳۳۶۱ ۳۳۶۰", eng: "3389 3388 3362 3361 3360",
            areas : [{name:"شهرک شاهد"},{name:"شهرک جمهوری اسلامی"},{name:"شهرک امام خمینی"},{name:"شهرک مطهری"},{name:"کیان شهر"}]
        },
        { name: "مرکز مخابرات آیت ا… کاشانی ۴۴۰۹ ۴۴۰۸ ۴۴۰۷ ۴۴۰۶ ۴۴۰۵ ۴۴۰۴ ۴۴۰۳ ۴۴۰۲ ۴۴۰۱ ۴۴۰۰", eng: "4409 4408 4407 4406 4405 4404 4403 4402 4401 4400",
            areas : [{name:"بلوار فردوس"},{name:"حسن‌آباد"},{name:"شهرک پرواز"},{name:"آیت‌ا… کاشانی"},{name:"ستاری"},{name:"صادقیه"}]
        },
        { name: "مرکز مخابرات زارعی ۴۴۱۷ ۴۴۱۶ ۴۴۱۵ ۴۴۱۴ ۴۴۱۳ ۴۴۱۲ ۴۴۱۱ ۴۴۱۰", eng: "4417 4416 4415 4414 4413 4412 4411 4410",
            areas : [{name:"کوی ارم"},{name:"اندیشه"},{name:"کوی الهام"},{name:"کوی سازمان برنامه"},{name:"سازمان آب"},{name:"بلوار آسیا"}]
        },
        { name: "مرکز مخابرات چیتگر ۴۴۱۹ ۴۴۱۸ ۴۴۷۹ ۴۴۸۹", eng: "4419 4418 4479 4489",
            areas : [{name:"چیتگر"},{name:"پیکان‌شهر"},{name:"شهرک سینمایی"},{name:"ویلاشهر"},{name:"شهرک ۲۲ بهمن"},{name:"شهرک دژبان"},{name:"شهرک کاج"},{name:"شهرک غزالی"}]
        },
        { name: "مرکز مخابرات سعادتمند ۴۴۲۹ ۴۴۲۸ ۴۴۲۷ ۴۴۲۶ ۴۴۲۵ ۴۴۲۴ ۴۴۲۳ ۴۴۲۲ ۴۴۲۱ ۴۴۲۰", eng: "4429 4428 4427 4426 4425 4424 4423 4422 4421 4429",
            areas : [{name:"ستارخان"},{name:"صادقیه"},{name:"کوی نور"},{name:"محمود آباد"},{name:"شهرک ژاندارمری"},{name:"شهرک انقلاب"},{name:"کوی ارمکان"},{name:"طرشت شمالی"},{name:"سازمان آب"},{name:"مرزداران"}]
        },
        { name: "مرکز مخابرات کاظمیان ۴۴۳۰ ۴۴۳۱ ۴۴۳۲ ۴۴۳۳ ۴۴۳۴ ۴۴۳۵ ۴۴۳۶ ۴۴۳۷", eng: "4437 4436 4435 4434 4432 4431 4430",
            areas : [{name:"شهران"},{name:"شهرک بعثت"},{name:"کن"},{name:"شهرزیبا"},{name:"opg"}]
        },
        { name: "مرکز مخابرات حق شناس ۴۴۷۷ ۴۴۷۶ ۴۴۷۵ ۴۴۷۴ ۴۴۷۳ ۴۴۷۲ ۴۴۷۱ ۴۴۷۰ ۴۴۳۹", eng: "4477 4476 4475 4474 4473 4472 4471 4470 4439",
            areas : [{name:"شهرک راه‌آهن"},{name:"دهکده المپیک"},{name:"شهرک دژبان"},{name:"مجتمع مسکونی لاله"},{name:"زیبادشت"},{name:"شهرک چشمه"},{name:"شهرک امیرکبیر"},{name:"شهرک جهادگران"}]
        },
        { name: "مرکز مخابرات پیام نور ۴۴۶۰ ۴۴۴۹ ۴۴۴۸ ۴۴۴۷ ۴۴۴۶ ۴۴۴۵ ۴۴۴۴ ۴۴۴۳ ۴۴۴۲ ۴۴۴۱ ۴۴۴۰", eng: "4440 4441 4442 4443 4444 4445 4446 4447 4448 4449 4460",
            areas : [{name:"پونک"},{name:"جنت‌آباد"},{name:"باغ فیض"},{name:"شهرک شاهین"},{name:"شهرک والفجر"},{name:"ستاری"},{name:"اشرفی اصفهانی"}]
        },
        { name: "مرکز مخابرات شهید توکلی ۴۴۵۸ ۴۴۵۷ ۴۴۵۶ ۴۴۵۵ ۴۴۵۴ ۴۴۵۳ ۴۴۵۲ ۴۴۵۱ ۴۴۵۰", eng: "4458 4457 4456 4455 4454 4453 4452 4451 4450",
            areas : [{name:"تهرانسر"},{name:"شهرک فرهنگیان"},{name:"شهرک آزادی"},{name:"شهرک انصار"},{name:"شهرک کاظمیه"},{name:"شهرک آسمان"},{name:"شهرک هواپیمایی کشوری"},{name:"شهرک دریا"}]
        },
        { name: "مرکز مخابرات صالح طبری ۴۴۶۹ ۴۴۶۸ ۴۴۶۷ ۴۴۶۶ ۴۴۶۵ ۴۴۶۴ ۴۴۶۳ ۴۴۶۲ ۴۴۶۱", eng: "4469 4468 4467 4466 4465 4464 4463 4462 4461",
            areas : [{name:"شهرک اکباتان"},{name:"شهرک آپادانا"},{name:"شهرک شهید فکوری"},{name:"کوی بیمه"},{name:"ترمینال غرب"}]
        },
        { name: "مرکز مخابرات یزدان‌پناه ۴۴۸۷ ۴۴۸۶ ۴۴۸۵ ۴۴۸۴ ۴۴۸۳ ۴۴۸۲ ۴۴۸۱ ۴۴۸۰", eng: "4487 4486 4485 4484 4483 4482 4481 4480",
            areas : [{name:"فرحزاد"},{name:"شهرک نفت"},{name:"شهرک سجاد"},{name:"شهرک کوهسار"},{name:"مرادآباد"},{name:"حصارک"},{name:"شهرک نیروی هوایی"},{name:"شهرک المهدی"},{name:"جنت‌آباد"},{name:"شهرک بعثت"}]
        },
        { name: "مرکز مخابرات ثابت قدم ۴۴۹۷ ۴۴۹۶ ۴۴۹۴ ۴۴۹۳ ۴۴۹۲ ۴۴۹۱ ۴۴۹۰", eng: "4497 4496 4494 4493 4492 4491 4490",
            areas : [{name:"شهرک دانشگاه تهران"},{name:"شهرک استقلال"},{name:"چیتگر"},{name:"آزادشهر"},{name:"شهرک شهرداری"}]
        },
        { name: "مرکز مخابرات وردآورد ۴۴۹۹ ۴۴۹۸", eng: "4498 4499",
            areas : [{name:"وردآورد"},{name:"باغ حاج صیف"},{name:"صنایع رنگ سازی"}]
        },
        { name: "مرکز مخابرات ۱۳ آبان ۵۵۹۹ ۵۵۹۸ ۵۵۹۷ ۵۵۹۶ ۵۵۵۴ ۵۵۵۳ ۵۵۵۲ ۵۵۵۱ ۵۵۵۰ ۵۵۰۳ ۵۵۰۲ ۵۵۰۱ ۵۵۰۰", eng: "5599 5598 5597 5596 5554 5553 5552 5551 5550 5503 5502 5501 5500",
            areas : [{name:"چهارصد دستگاه"},{name:"اسفندیاری"},{name:"یاخچی‌آباد"},{name:"کوی آزادی"},{name:"خانی‌آبادنو"},{name:"شهرک بستان"},{name:"شهرک معراج"},{name:"کوی ۱۳ آبان"},{name:"عظیم‌آباد"},{name:"صالح‌آباد"},{name:"شهرک رسالت"},{name:"عبدالله‌آباد"},{name:"محمدآباد"},{name:"کریم‌آباد"},{name:"اندرمان"},{name:"مبارک‌آباد"},{name:"خلازیل"},{name:"شهرک مصطفی خمینی"},{name:"عباس‌آباد"},{name:"شهید رجائی"}]
        },
        { name: "مرکز مخابرات نواب صفوی ۵۵۴۴ ۵۵۴۳ ۵۵۴۲ ۵۵۴۱ ۵۵۴۰ ۵۵۰۴", eng: "5544 5543 5542 5541 5540 5504",
            areas : [{name:"میدان قزوین"},{name:"خیابان قزوین"},{name:"پارک رازی"},{name:"بیمارستان فارابی"}]
        },
        { name: "مرکز مخابرات بعثت ۵۵۳۵ ۵۵۳۴ ۵۵۳۳ ۵۵۳۲ ۵۵۳۱ ۵۵۳۰ ۵۵۱۸ ۵۵۰۹ ۵۵۰۸ ۵۵۰۷ ۵۵۰۶ ۵۵۰۵", eng: "5535 5534 5533 5532 5531 5530 5518 5509 5508 5507 5506 5505",
            areas : [{name:"باغ آذری"},{name:"خزانه بخارا"},{name:"شهرک بعثت"},{name:"شهرک مطهری"},{name:"شهرک طالقانی"},{name:"علی‌آباد"},{name:"شهرک شهید بهشتی"},{name:"فهیم‌آباد"},{name:"نازی‌آباد"}]
        },
        { name: "مرکز مخابرات شهید رمضانی ۵۵۶۹ ۵۵۶۸ ۵۵۶۷ ۵۵۶۶ ۵۵۶۵ ۵۵۶۴ ۵۵۱۲", eng: "5569 5568 5567 5566 5565 5564 5512",
            areas : [{name:"قلعه مرغی"},{name:"جوادیه"},{name:"راه‌آهن"}]
        },
        { name: "مرکز مخابرات سیدالشهدا ۵۵۷۸ ۵۵۷۷ ۵۵۷۶ ۵۵۷۵ ۵۵۷۴ ۵۵۷۳ ۵۵۷۲ ۵۵۷۱ ۵۵۷۰ ۵۵۱۴ ۵۵۱۳", eng: "5578 5577 5576 5575 5574 5573 5572 5571 5570 5514 5513",
            areas : [{name:"بریانک"},{name:"خزانه فلاح"},{name:"امین الملک"}]
        },
        { name: "مرکز مخابرات قندی ۵۵۸۹ ۵۵۸۱ ۵۵۸۰ ۵۵۷۹ ۵۵۶۳ ۵۵۶۲ ۵۵۶۱ ۵۵۶۰ ۵۵۵۹ ۵۵۵۸ ۵۵۵۷ ۵۵۱۶ ۵۵۱۵", eng: "5589 5581 5580 5579 5563 5562 5561 5560 5559 5558 5557 5516 5515",
            areas : [{name:"بازار"},{name:"خانی‌آباد"},{name:"مولوی"},{name:"خیام"}]
        },
        { name: "مرکز مخابرات بختیاری ۵۵۲۳ ۵۵۲۲ ۵۵۲۱ ۵۵۲۰", eng: "5523 5522 5521 5520",
            areas : [{name:"قلعه فتح‌آباد"},{name:"خیرآباد"},{name:"شهرسنگ"},{name:"باقرشهر"},{name:"باقراف"},{name:"جعفرآباد"},{name:"جعفرآباد"},{name:"بهشت زهرا"},{name:"چهل خرواری"}]
        },
        { name: "مرکز مخابرات آیت‌ا… ایروانی ۵۵۲۹ ۵۵۲۸ ۵۵۲۷ ۵۵۲۶ ۵۵۲۵ ۵۵۲۴", eng: "5529 5528 5527 5526 5525 5524",
            areas : [{name:"چهار دانگه"},{name:"شهید باهنر"},{name:"تپه سیف"},{name:"قاسم‌آباد"},{name:"شهرک اسلام‌آباد"},{name:"شهرک مطهری"},{name:"باغ چهاربری"},{name:"شهرک گل‌شهر"},{name:"حسین‌آباد"},{name:"عبدالله‌آباد"},{name:"ناصر‌آباد"},{name:"شاتره"},{name:"ملک‌آباد"}]
        },
        { name: "مرکز مخابرات مهدیه ۵۵۴۹ ۵۵۴۸ ۵۵۳۹ ۵۵۳۸ ۵۵۳۷ ۵۵۳۶", eng: "5549 5548 5539 5538 5537 5536",
            areas : [{name:"امیریه"},{name:"میدان راه‌آهن"},{name:"مولوی"}]
        },
        { name: "مرکز مخابرات خوشقدم ۵۵۸۸ ۵۵۸۷ ۵۵۸۶ ۵۵۸۵ ۵۵۸۴ ۵۵۸۳ ۵۵۸۲", eng: "5588 5587 5586 5585 5584 5583 5582",
            areas : [{name:"شریعتی"},{name:"عبدل‌آباد"},{name:"نعمت‌آباد"},{name:"شهرک ابوذر"},{name:"دولت‌خواه شریفی"}]
        },
        { name: "مرکز مخابرات شهید منتظری ۵۵۹۵ ۵۵۹۴ ۵۵۹۳ ۵۵۹۲ ۵۵۹۱ ۵۵۹۰", eng: "5595 5594 5593 5592 5591 5590",
            areas : [{name:"شهر ری"},{name:"کوی ارشاد"},{name:"ولی‌آباد"},{name:"دولت‌آباد"},{name:"قیصریه"},{name:"شهرک فاطمه"}]
        },
        { name: "مرکز مخابرات فرد اسدی ۶۶۱۶ ۶۶۰۸ ۶۶۰۷ ۶۶۰۶ ۶۶۰۵ ۶۶۰۴ ۶۶۰۳ ۶۶۰۲ ۶۶۰۱ ۶۶۰۰", eng: "6616 6608 6607 6606 6605 6604 6603 6602 6601 6600",
            areas : [{name:"مهرآباد"},{name:"طرشت"},{name:"جاویدآباد"},{name:"جیحون"},{name:"آزادی"}]
        },
        { name: "مرکز مخابرات دانشگاه ۶۶۹۵ ۶۶۴۹ ۶۶۴۸ ۶۶۴۷ ۶۶۴۶ ۶۶۴۵ ۶۶۴۴ ۶۶۴۱ ۶۶۴۰ ۶۶۱۷ ۶۶۱۵ ۶۶۱۴ ۶۶۱۲ ۶۶۹۸ ۶۶۹۷ ۶۶۹۶", eng: "6695 6649 6648 6647 6646 6645 6644 6641 6640 6617 6615 6614 6612 6698 6697 6696",
            areas : [{name:"منیریه"},{name:"ولیعصر"},{name:"فلسطین"},{name:"جمهوری"},{name:"میدان حر"},{name:"کارگر"},{name:"پاستور"},{name:"انقلاب"}]
        },
        { name: "مرکز مخابرات بخششی ۶۶۳۹ ۶۶۲۸ ۶۶۲۶ ۶۶۲۵ ۶۶۱۸", eng: "6639 6628 6626 6625 6618",
            areas : [{name:"کوی سینا"},{name:"شهرک طالقانی"},{name:"نوروزآباد"}]
        },
        { name: "مرکز مخابرات کرمی ۶۶۳۳ ۶۶۳۲ ۶۶۳۱ ۶۶۳۰ ۶۶۲۹ ۶۶۲۴ ۶۶۲۳ ۶۶۲۲ ۶۶۲۱ ۶۶۲۰", eng: "6633 6632 6631 6630 6629 6624 6623 6622 6621 6620",
            areas : [{name:"شهرک امام خمینی"},{name:"شهرک طالقانی"},{name:"شهرک مسلمین"},{name:"شهرک صاحب الزمان"},{name:"اسماعیل‌آباد"}]
        },
        { name: "مرکز مخابرات مالک اشتر ۶۶۸۹ ۶۶۸۸ ۶۶۸۷ ۶۶۸۶ ۶۶۸۵ ۶۶۸۴ ۶۶۸۳ ۶۶۳۸ ۶۶۳۷ ۶۶۳۶ ۶۶۳۵ ۶۶۳۴", eng: "6689 6688 6687 6686 6685 6684 6683 6638 6637 6636 6635 6634",
            areas : [{name:"نواب"},{name:"هاشمی"},{name:"جیحون"},{name:"رودکی"}]
        },
        { name: "مرکز مخابرات توحید ۶۶۹۴ ۶۶۹۳ ۶۶۹۲ ۶۶۹۱ ۶۶۹۰ ۶۶۵۹ ۶۶۵۸ ۶۶۵۷ ۶۶۵۶ ۶۶۴۳ ۶۶۴۲", eng: "6694 6693 6692 6691 6690 6659 6658 6657 6656 6643 6642",
            areas : [{name:"توحید"},{name:"جمشیدیه"},{name:"باقرخان"},{name:"ستارخان"},{name:"آزادی"},{name:"بلوار کشاورز"},{name:"جمهوری"},{name:"اسکندری"}]
        },
        { name: "مرکز مخابرات شهید چمران ۶۶۵۵ ۶۶۵۴ ۶۶۵۲ ۶۶۵۱ ۶۶۵۰", eng: "6655 6654 6652 6651 6650",
            areas : [{name:"دریان نو"},{name:"ستارخان"},{name:"بهبودی"},{name:"شادمهر"}]
        },
        { name: "مرکز مخابرات ابوذر ۶۶۶۹ ۶۶۶۸ ۶۶۶۷ ۶۶۶۶ ۶۶۶۵ ۶۶۶۴ ۶۶۶۳ ۶۶۶۲ ۶۶۶۱ ۶۶۶۰", eng: "6669 6668 6667 6666 6665 6664 6663 6662 6661 6660",
            areas : [{name:"سه راه آذری"},{name:"اکبر‌آباد"},{name:"کوی مهرآباد"},{name:"فتح"}]
        },
        { name: "مرکز مخابرات حافظ ۶۶۷۶ ۶۶۷۵ ۶۶۷۴ ۶۶۷۳ ۶۶۷۲ ۶۶۷۱ ۶۶۷۰", eng: "6676 6675 6674 6673 6672 6671 6670",
            areas : [{name:"جمهوری"},{name:"امام خمینی"},{name:"نوفل لوشاتو"},{name:"فردوسی"},{name:"لاله‌زار"}]
        },
        { name: "مرکز مخابرات محسنیان ۶۶۸۲ ۶۶۸۱ ۶۶۸۰ ۶۶۷۹ ۶۶۷۸", eng: "6682 6681 6680 6679 6678",
            areas : [{name:"یافت‌آباد"},{name:"کوی ۱۷ شهریور"},{name:"شادآباد"},{name:"سعیدآباد"},{name:"ابراهیم‌آباد"},{name:"شهرک آزادی"},{name:"ترک‌آباد"},{name:"شهرک مسیح آبادی"},{name:"عرب‌آباد"}]
        },
        { name: "مرکز مخابرات آل‌اسحاق ۷۷۳۱ ۷۷۳۰ ۷۷۰۲ ۷۷۰۱ ۷۷۰۰", eng: "7731 7730 7702 7701 7700",
            areas : [{name:"حکیمیه"},{name:"شهرک والفجر"},{name:"کوی دانشگاه"}]
        },
        { name: "مرکز مخابرات شهدای گمنام ۷۷۳۸ ۷۷۳۷ ۷۷۳۶ ۷۷۰۸ ۷۷۰۷ ۷۷۰۶ ۷۷۰۵ ۷۷۰۴", eng: "7738 7737 7736 7708 7707 7706 7705 7704",
            areas : [{name:"تهران پارس"},{name:"شهرک امید"},{name:"قنات کوثر"},{name:"مجیدآباد"},{name:"شهرک پارس"},{name:"باقری"}]
        },
        { name: "مرکز مخابرات شهید بابایی ۷۷۱۱ ۷۷۱۰", eng: "7711 7710",
            areas : [{name:"شهرک دانشگاه امام حسین"},{name:"بزرگراه بابایی"}]
        },
        { name: "مرکز مخابرات اکبری ۷۷۹۶ ۷۷۷۹ ۷۷۷۸ ۷۷۳۹ ۷۷۳۵ ۷۷۳۴ ۷۷۳۳ ۷۷۳۲ ۷۷۱۴", eng: "7796 7779 7778 7739 7735 7734 7733 7732 7714",
            areas : [{name:"تهران پارس"},{name:"خاک سفید"},{name:"حکیمیه"},{name:"شهرک مجیدآباد"},{name:"کوی بانک سپه"},{name:"شهرک شهید با هنر"},{name:"شهرک مطهری"},{name:"شهرک طالقانی"},{name:"شهرک انقلاب"},{name:"شهرک شاهد"},{name:"جوادیه"},{name:"جشنواره"}]
        },
        { name: "مرکز مخابرات امامت ۷۷۹۸ ۷۷۴۸ ۷۷۴۷ ۷۷۴۶ ۷۷۴۳ ۷۷۴۲ ۷۷۴۱ ۷۷۴۰ ۷۷۱۷ ۷۷۱۶", eng: "7798 7748 7747 7746 7743 7742 7741 7740 7717 7716",
            areas : [{name:"نیرو هوایی"},{name:"تهران نو"},{name:"کوی فاطمیه"},{name:"کوی زینبیه"},{name:"منوچهری"},{name:"پیروزی"}]
        },
        { name: "مرکز مخابرات حکمت شعار ۷۷۸۹ ۷۷۸۰ ۷۷۴۹ ۷۷۴۵ ۷۷۴۴ ۷۷۲۷ ۷۷۲۴ ۷۷۲۳ ۷۷۲۲ ۷۷۲۱ ۷۷۲۰ ۷۷۱۹ ۷۷۱۸", eng: "7789 7780 7749 7745 7744 7727 7724 7723 7722 7721 7720 7719 7718",
            areas : [{name:"رسالت"},{name:"شمیران نو"},{name:"کالاد"},{name:"الغدیر"},{name:"دلاوران"},{name:"فرجام"}]
        },
        { name: "مرکز مخابرات آیت ۷۷۹۹ ۷۷۸۴ ۷۷۸۳ ۷۷۸۲ ۷۷۸۱ ۷۷۶۹ ۷۷۲۸ ۷۷۲۶ ۷۷۲۵", eng: "7799 7784 7783 7782 7781 7769 7728 7726 7725",
            areas : [{name:"نظام‌آباد"},{name:"وحیدیه"},{name:"دماوند"}]
        },
        { name: "مرکز مخابرات شهید عاطف ۷۷۸۸ ۷۷۸۷ ۷۷۸۶ ۷۷۷۴ ۷۷۷۳ ۷۷۷۲ ۷۷۷۱ ۷۷۷۰ ۷۷۲۹", eng: "7788 7787 7786 7774 7773 7772 7771 7770 7729",
            areas : [{name:"تهران پارس"},{name:"دماوند"},{name:"رسالت"},{name:"باقری"},{name:"ترمینال شرق"}]
        },
        { name: "مرکز مخابرات ولیعصر ۷۷۹۷ ۷۷۶۶ ۷۷۶۵ ۷۷۶۴ ۷۷۶۳ ۷۷۶۲ ۷۷۶۱ ۷۷۶۰ ۷۷۵۳ ۷۷۵۲ ۷۷۵۱ ۷۷۵۰", eng: "7797 7766 7765 7764 7763 7762 7761 7760 7753 7752 7751 7750",
            areas : [{name:"میدان سپاه"},{name:"بهارستان"},{name:"انقلاب"},{name:"امام حسین"},{name:"مازندران"},{name:"شریعتی"}]
        },
        { name: "مرکز مخابرات نظری ۷۷۵۹ ۷۷۵۸ ۷۷۵۷ ۷۷۵۶ ۷۷۵۵ ۷۷۵۴", eng: "7759 7758 7757 7756 7755 7754",
            areas : [{name:"خیابان گرگان"},{name:"میدان نامجو"},{name:"دماوند"},{name:"آیت‌ا… مدنی"},{name:"امام حسین"}]
        },
        { name: "مرکز مخابرات نبوت ۷۷۹۵ ۷۷۹۴ ۷۷۹۳ ۷۷۹۲ ۷۷۹۱ ۷۷۹۰", eng: "7795 7794 7793 7792 7791 7790",
            areas : [{name:"نارمک"},{name:"شهید باقری"},{name:"دماوند"}]
        },
        { name: "مرکز مخابرات قدس ۸۸۶۳ ۸۸۳۵ ۸۸۳۳ ۸۸۰۲ ۸۸۰۱ ۸۸۰۰", eng: "8863 8835 8833 8802 8801 8800",
            areas : [{name:"یوسف‌آباد"},{name:"امیرآباد"},{name:"قزل قلعه"},{name:"شهید گمنام"},{name:"کارگر"}]
        },
        { name: "مرکز مخابرات شیخ فضل ا…", eng: "8862 8861 8860 8821 8806 8805 8804 8803",
            areas : [{name:"ونک"},{name:"کردستان"},{name:"ملاصدرا"},{name:"شیخ بهایی"},{name:"شهرک سئول"},{name:"قلعه ارامنه"}]
        },
        { name: "مرکز مخابرات نهری ۸۸۶۹ ۸۸۶۸ ۸۸۵۹ ۸۸۵۸ ۸۸۵۷ ۸۸۵۶ ۸۸۳۸ ۸۸۳۷ ۸۸۳۶ ۸۸۰۹ ۸۸۰۸ ۸۸۰۷", eng: "8869 8868 8859 8858 8857 8856 8838 8837 8836 8809 8808 8807",
            areas : [{name:"شهرک غرب"},{name:"خوردین"},{name:"پونک باختری"},{name:"بلوار دریا"}]
        },
        { name: "مرکز مخابرات مطهری ۸۸۷۲ ۸۸۷۱ ۸۸۷۰ ۸۸۵۵ ۸۸۱۰", eng: "8872 8871 8870 8855 8810",
            areas : [{name:"یوسف‌آباد"},{name:"خالد اسلامبولی"},{name:"ولی عصر"},{name:"آرژانتین"}]
        },
        { name: "مرکز مخابرات هفت تیر ۸۸۸۶ ۸۸۸۴ ۸۸۸۳ ۸۸۸۲ ۸۸۸۱ ۸۸۳۴ ۸۸۳۲ ۸۸۳۱ ۸۸۳۰ ۸۸۱۷ ۸۸۱۵ ۸۸۱۴", eng: "8886 8884 8883 8882 8881 8834 8832 8831 8830 8817 8815 8814",
            areas : [{name:"هفت تیر"},{name:"کریمخان"},{name:"قائم مقام"},{name:"سمیه"},{name:"ایرانشهر"}]
        },
        { name: "مرکز مخابرات شهید کلانتری ۸۸۸۸ ۸۸۸۷ ۸۸۸۵ ۸۸۷۹ ۸۸۷۸ ۸۸۷۷ ۸۸۶۷ ۸۸۶۶ ۸۸۶۵ ۸۸۶۴ ۸۸۲۰", eng: "8888 8887 8885 8879 8878 8877 8867 8866 8865 8864 8820",
            areas : [{name:"حقانی"},{name:"ملاصدرا"},{name:"میدان ونک"},{name:"جردن"},{name:"گاندی"},{name:"برزیل"},{name:"کاوسیه"},{name:"شهرک فجر"}]
        },
        { name: "مرکز مخابرات نصرالهی ۸۸۲۹ ۸۸۲۸ ۸۸۲۷ ۸۸۲۶ ۸۸۲۵ ۸۸۲۴ ۸۸۲۳ ۸۸۲۲", eng: "8829 8828 8827 8826 8825 8824 8823 8822",
            areas : [{name:"گیشا"},{name:"کوی نصر"},{name:"شهرآرا"},{name:"شهرک آزمایش"},{name:"تهران ویلا"},{name:"جلال آل احمد"}]
        },
        { name: "مرکز مخابرات شهید مدنی ۸۸۹۹ ۸۸۹۸ ۸۸۹۷ ۸۸۹۶ ۸۸۹۵ ۸۸۳۹", eng: "8899 8898 8897 8896 8895 8839",
            areas : [{name:"فاطمی"},{name:"بلوار کشاورز"},{name:"زرتشت"},{name:"شهید گمنام"}]
        },
        { name: "مرکز مخابرات شهید بهشتی ۸۸۴۸ ۸۸۴۷ ۸۸۴۶ ۸۸۴۵ ۸۸۴۴ ۸۸۴۳ ۸۸۴۲ ۸۸۴۱ ۸۸۴۰", eng: "8848 8847 8846 8845 8844 8843 8842 8841 8840",
            areas : [{name:"حشمتیه"},{name:"باغ صبا"},{name:"جانبازان"},{name:"معلم"}]
        },
        { name: "مرکز مخابرات آزادگان ۸۸۷۶ ۸۸۷۵ ۸۸۷۴ ۸۸۷۳ ۸۸۵۴ ۸۸۵۳ ۸۸۵۲ ۸۸۵۱ ۸۸۵۰", eng: "8876 8875 8874 8873 8854 8853 8852 8851 8850",
            areas : [{name:"عباس‌آباد"},{name:"سهروردی"},{name:"آپادانا"},{name:"مصلی"},{name:"هویزه"},{name:"بیهقی"}]
        },
        { name: "مرکز مخابرات رجائی ۸۸۹۴ ۸۸۹۳ ۸۸۹۲ ۸۸۹۱ ۸۸۹۰ ۸۸۸۹ ۸۸۸۰", eng: "8894 8893 8892 8891 8890 8889 8880",
            areas : [{name:"میدان ولیعصر"},{name:"کریمخان"},{name:"نجات اللهی"},{name:"سمیه"},{name:"فلسطین"},{name:"زرتشت"},{name:"بهجت‌آباد"}]
        }
    ];
    //tnx http://sazinco.ir/


    var __all = [estateCodes,countryCodes,mobileCodes,plates,necessary,tehranCodes];
    var __addkeymapping = function(){
	    for (var i = 0, len = __all.length; i < len; i++){
		var __arr = __all[i];
		for (var j = 0; j< __arr.length; j++){
			var code = __arr[j];
 			code.keymap = mapper.farsi_mapper(code.name);
		}
	    }

    }
    __addkeymapping();

    return {
        getEstateCodes : function(){
            return estateCodes.concat(mobileCodes);
        },
        getCountryCodes : function(){
            return countryCodes;
        },
        getPlates : function(){
            return plates;
        },
        getNecessary : function(){
            return necessary;
        },
        getTehranCodes : function(){
            return tehranCodes;
        }
    }

});
